using System.Drawing;

namespace MoMobile.Map.Common
{
   //============================================================
   // <T>地图瓦片对象。</T>
   //============================================================
   public class FMbMapTile
   {
      // 编号
      protected int _id;

      // 图片资源
      protected Bitmap _resource;

      //============================================================
      // <T>获取或得到编号。</T>
      //============================================================
      public int Id {
         get { return _id; }
         set { _id = value; }
      }

      //============================================================
      // <T>获取或得到图片。</T>
      //============================================================
      public Bitmap Resource {
         get { return _resource; }
         set { _resource = value; }
      }
   }
}
