package org.mo.eng.session;

import org.mo.eng.session.common.ISession;

//============================================================
// <T>应用程序逻辑会话控制台接口。</T>
//============================================================
public interface ISessionConsole
{
   //============================================================
   // <T>根据代码查找会话对象。</T>
   //
   // @param code 代码
   // @return 会话对象
   //============================================================
   <V extends ISession> V find(String code);

   //============================================================
   // <T>根据代码获得会话对象。</T>
   //
   // @param code 代码
   // @return 会话对象
   //============================================================
   <V extends ISession> V get(String code);

   //============================================================
   // <T>根据代码同步会话对象。</T>
   //
   // @param code 代码
   // @return 会话对象
   //============================================================
   <V extends ISession> V sync(Class<V> clazz,
                               String code);

   //============================================================
   // <T>根据代码移除会话对象。</T>
   //
   // @param code 代码
   //============================================================
   void remove(String code);
}
