namespace MO.Common.Geom
{
   //============================================================
   // <T>尺寸。</T>
   //============================================================
   public class SSize2<T>
   {
      // 宽度
      public T Width;

      // 高度
      public T Height;

      //============================================================
      // <T>构造尺寸。</T>
      //============================================================
      public SSize2() {
      }

      //============================================================
      // <T>构造尺寸。</T>
      //
      // @param width 宽度
      // @param height 高度
      //============================================================
      public SSize2(T width, T height) {
         Width = width;
         Height = height;
      }

      //============================================================
      // <T>接收尺寸对象。</T>
      //
      // @param size 尺寸对象
      //============================================================
      public void Assign(SSize2<T> size) {
         if(size != null) {
            Width = size.Width;
            Height = size.Height;
         }
      }

      //============================================================
      // <T>设置尺寸。</T>
      //
      // @param width 宽度
      // @param height 高度
      //============================================================
      public void Set(T width, T height) {
         Width = width;
         Height = height;
      }

      //============================================================
      // <T>格式化成字符串。</T>
      //
      // @return 字符串
      //============================================================
      public override string ToString() {
         return Width + "," + Height;
      }
   }
}
