using SlimDX.Direct2D;

namespace MO.DirectX.Draw
{
   //============================================================
   // <T>色刷。</T>
   //
   // @history MAOCY 120223
   //============================================================
   public class FDxBrush : FDxObject2D
   {
      // 本地对象
      protected Brush _native;

      // 色刷属性
      protected BrushProperties _properties;

      //============================================================
      // <T>构造色刷。</T>
      //============================================================
      public FDxBrush() {
      }
   
      //============================================================
      // <T>获得本地对象。</T>
      //============================================================
      public Brush Native {
         get { return _native; }
      }
   }
}
