package org.mo.web.core.webform.control;

//============================================================
// <T>控件接口对象的XML节点基类。</T>
//============================================================
public interface XControlFace
      extends
         XComponentFace,
         XDisplayFace,
         XPadFace,
         XSizeFace
{
   // 名称定义
   String NAME = "Control";

   // 无回行的名称定义
   String PTY_NOWRAP = "nowrap";

   // 状态栏提示的名称定义
   String PTY_HINT = "hint";

   // 控件样式的名称定义
   String PTY_STYLE_REFER = "style_refer";

   // 标签样式的名称定义
   String PTY_STYLE_LABEL = "style_label";

   // 编辑样式的名称定义
   String PTY_STYLE_EDIT = "style_edit";

   // 版本的名称定义
   String PTY_VERSION = "version";

   //============================================================
   // <T>获得无回行的内容。</T>
   //
   // @return 无回行
   //============================================================
   Boolean getNowrap();

   //============================================================
   // <T>设置无回行的内容。</T>
   //
   // @param value 无回行
   //============================================================
   void setNowrap(Boolean value);

   //============================================================
   // <T>获得状态栏提示的内容。</T>
   //
   // @return 状态栏提示
   //============================================================
   String getHint();

   //============================================================
   // <T>设置状态栏提示的内容。</T>
   //
   // @param value 状态栏提示
   //============================================================
   void setHint(String value);

   //============================================================
   // <T>获得控件样式的内容。</T>
   //
   // @return 控件样式
   //============================================================
   String getStyleRefer();

   //============================================================
   // <T>设置控件样式的内容。</T>
   //
   // @param value 控件样式
   //============================================================
   void setStyleRefer(String value);

   //============================================================
   // <T>获得标签样式的内容。</T>
   //
   // @return 标签样式
   //============================================================
   String getStyleLabel();

   //============================================================
   // <T>设置标签样式的内容。</T>
   //
   // @param value 标签样式
   //============================================================
   void setStyleLabel(String value);

   //============================================================
   // <T>获得编辑样式的内容。</T>
   //
   // @return 编辑样式
   //============================================================
   String getStyleEdit();

   //============================================================
   // <T>设置编辑样式的内容。</T>
   //
   // @param value 编辑样式
   //============================================================
   void setStyleEdit(String value);

   //============================================================
   // <T>获得版本的内容。</T>
   //
   // @return 版本
   //============================================================
   String getVersion();

   //============================================================
   // <T>设置版本的内容。</T>
   //
   // @param value 版本
   //============================================================
   void setVersion(String value);
}
