package org.mo.web.core.webform.control;

import org.mo.com.xml.IXmlObject;

//============================================================
// <T>数据集接口对象的XML节点基类。</T>
//============================================================
public interface XDatasetFace
      extends IXmlObject
{
   // 名称定义
   String NAME = "MDataset";

   // 数据集名称的名称定义
   String PTY_DATASET = "dataset";

   // 数据来源的名称定义
   String PTY_DATASET_FROM = "dataset_from";

   // 数据处理的名称定义
   String PTY_DATASET_PROCEDURE = "dataset_procedure";

   // 数据服务的名称定义
   String PTY_DATASET_SERVICE = "dataset_service";

   // 数据搜索的名称定义
   String PTY_DATASET_SEARCH = "dataset_search";

   // 数据分组的名称定义
   String PTY_DATASET_GROUP = "dataset_group";

   // 数据排序的名称定义
   String PTY_DATASET_ORDER = "dataset_order";

   // 数据参数的名称定义
   String PTY_DATASET_PARAMETERS = "dataset_parameters";

   // 操作数据准备的名称定义
   String PTY_DATASET_PREPARE = "dataset_prepare";

   // 新建数据参数的名称定义
   String PTY_DATASET_INSERT_PARAMETERS = "dataset_insert_parameters";

   // 新建数据的名称定义
   String PTY_DATASET_INSERT = "dataset_insert";

   // 更新数据参数的名称定义
   String PTY_DATASET_UPDATE_PARAMETERS = "dataset_update_parameters";

   // 更新数据的名称定义
   String PTY_DATASET_UPDATE = "dataset_update";

   // 删除数据参数的名称定义
   String PTY_DATASET_DELETE_PARAMETERS = "dataset_delete_parameters";

   // 删除数据的名称定义
   String PTY_DATASET_DELETE = "dataset_delete";

   // 编辑模式的名称定义
   String PTY_EDIT_MODE = "edit_mode";

   // 编辑设置的名称定义
   String PTY_EDIT_CONFIG = "edit_config";

   // 复制编辑可的名称定义
   String PTY_EDIT_COPY = "edit_copy";

   // 查询编辑可的名称定义
   String PTY_EDIT_FETCH = "edit_fetch";

   // 搜索编辑可的名称定义
   String PTY_EDIT_SEARCH = "edit_search";

   // 选取编辑可的名称定义
   String PTY_EDIT_PICKER = "edit_picker";

   // 放大编辑可的名称定义
   String PTY_EDIT_ZOOM = "edit_zoom";

   // 打印编辑可的名称定义
   String PTY_EDIT_PRINT = "edit_print";

   // 操作编辑可的名称定义
   String PTY_EDIT_ACTION = "edit_action";

   // 新建编辑可的名称定义
   String PTY_EDIT_INSERT = "edit_insert";

   // 修改编辑可的名称定义
   String PTY_EDIT_UPDATE = "edit_update";

   // 删除编辑可的名称定义
   String PTY_EDIT_DELETE = "edit_delete";

   // 检查权限的名称定义
   String PTY_VALID_ACCESS = "valid_access";

   // 新建检查可的名称定义
   String PTY_VALID_INSERT = "valid_insert";

   // 更新检查可的名称定义
   String PTY_VALID_UPDATE = "valid_update";

   // 删除检查可的名称定义
   String PTY_VALID_DELETE = "valid_delete";

   // 新建处理的名称定义
   String PTY_ACTION_INSERT = "action_insert";

   // 更新处理的名称定义
   String PTY_ACTION_UPDATE = "action_update";

   // 删除处理的名称定义
   String PTY_ACTION_DELETE = "action_delete";

   // 操作准备的名称定义
   String PTY_ACTION_PREPARE = "action_prepare";

   // 工具栏显示的名称定义
   String PTY_DISP_TOOLBAR = "disp_toolbar";

   // 逻辑名称的名称定义
   String PTY_LG_NAME = "lg_name";

   //============================================================
   // <T>获得数据集名称的内容。</T>
   //
   // @return 数据集名称
   //============================================================
   String getDataset();

   //============================================================
   // <T>设置数据集名称的内容。</T>
   //
   // @param value 数据集名称
   //============================================================
   void setDataset(String value);

   //============================================================
   // <T>获得数据来源的内容。</T>
   //
   // @return 数据来源
   //============================================================
   String getDatasetFrom();

   //============================================================
   // <T>设置数据来源的内容。</T>
   //
   // @param value 数据来源
   //============================================================
   void setDatasetFrom(String value);

   //============================================================
   // <T>获得数据处理的内容。</T>
   //
   // @return 数据处理
   //============================================================
   String getDatasetProcedure();

   //============================================================
   // <T>设置数据处理的内容。</T>
   //
   // @param value 数据处理
   //============================================================
   void setDatasetProcedure(String value);

   //============================================================
   // <T>获得数据服务的内容。</T>
   //
   // @return 数据服务
   //============================================================
   String getDatasetService();

   //============================================================
   // <T>设置数据服务的内容。</T>
   //
   // @param value 数据服务
   //============================================================
   void setDatasetService(String value);

   //============================================================
   // <T>获得数据搜索的内容。</T>
   //
   // @return 数据搜索
   //============================================================
   String getDatasetSearch();

   //============================================================
   // <T>设置数据搜索的内容。</T>
   //
   // @param value 数据搜索
   //============================================================
   void setDatasetSearch(String value);

   //============================================================
   // <T>获得数据分组的内容。</T>
   //
   // @return 数据分组
   //============================================================
   String getDatasetGroup();

   //============================================================
   // <T>设置数据分组的内容。</T>
   //
   // @param value 数据分组
   //============================================================
   void setDatasetGroup(String value);

   //============================================================
   // <T>获得数据排序的内容。</T>
   //
   // @return 数据排序
   //============================================================
   String getDatasetOrder();

   //============================================================
   // <T>设置数据排序的内容。</T>
   //
   // @param value 数据排序
   //============================================================
   void setDatasetOrder(String value);

   //============================================================
   // <T>获得数据参数的内容。</T>
   //
   // @return 数据参数
   //============================================================
   String getDatasetParameters();

   //============================================================
   // <T>设置数据参数的内容。</T>
   //
   // @param value 数据参数
   //============================================================
   void setDatasetParameters(String value);

   //============================================================
   // <T>获得操作数据准备的内容。</T>
   //
   // @return 操作数据准备
   //============================================================
   String getDatasetPrepare();

   //============================================================
   // <T>设置操作数据准备的内容。</T>
   //
   // @param value 操作数据准备
   //============================================================
   void setDatasetPrepare(String value);

   //============================================================
   // <T>获得新建数据参数的内容。</T>
   //
   // @return 新建数据参数
   //============================================================
   String getDatasetInsertParameters();

   //============================================================
   // <T>设置新建数据参数的内容。</T>
   //
   // @param value 新建数据参数
   //============================================================
   void setDatasetInsertParameters(String value);

   //============================================================
   // <T>获得新建数据的内容。</T>
   //
   // @return 新建数据
   //============================================================
   String getDatasetInsert();

   //============================================================
   // <T>设置新建数据的内容。</T>
   //
   // @param value 新建数据
   //============================================================
   void setDatasetInsert(String value);

   //============================================================
   // <T>获得更新数据参数的内容。</T>
   //
   // @return 更新数据参数
   //============================================================
   String getDatasetUpdateParameters();

   //============================================================
   // <T>设置更新数据参数的内容。</T>
   //
   // @param value 更新数据参数
   //============================================================
   void setDatasetUpdateParameters(String value);

   //============================================================
   // <T>获得更新数据的内容。</T>
   //
   // @return 更新数据
   //============================================================
   String getDatasetUpdate();

   //============================================================
   // <T>设置更新数据的内容。</T>
   //
   // @param value 更新数据
   //============================================================
   void setDatasetUpdate(String value);

   //============================================================
   // <T>获得删除数据参数的内容。</T>
   //
   // @return 删除数据参数
   //============================================================
   String getDatasetDeleteParameters();

   //============================================================
   // <T>设置删除数据参数的内容。</T>
   //
   // @param value 删除数据参数
   //============================================================
   void setDatasetDeleteParameters(String value);

   //============================================================
   // <T>获得删除数据的内容。</T>
   //
   // @return 删除数据
   //============================================================
   String getDatasetDelete();

   //============================================================
   // <T>设置删除数据的内容。</T>
   //
   // @param value 删除数据
   //============================================================
   void setDatasetDelete(String value);

   //============================================================
   // <T>获得编辑模式的内容。</T>
   //
   // @return 编辑模式
   //============================================================
   String getEditMode();

   //============================================================
   // <T>设置编辑模式的内容。</T>
   //
   // @param value 编辑模式
   //============================================================
   void setEditMode(String value);


   //============================================================
   // <T>获得编辑设置的内容。</T>
   //
   // @return 编辑设置
   //============================================================
   String getEditConfig();

   //============================================================
   // <T>设置编辑设置的内容。</T>
   //
   // @param value 编辑设置
   //============================================================
   void setEditConfig(String value);


   //============================================================
   // <T>获得复制编辑可的内容。</T>
   //
   // @return 复制编辑可
   //============================================================
   Boolean getEditCopy();

   //============================================================
   // <T>设置复制编辑可的内容。</T>
   //
   // @param value 复制编辑可
   //============================================================
   void setEditCopy(Boolean value);

   //============================================================
   // <T>获得查询编辑可的内容。</T>
   //
   // @return 查询编辑可
   //============================================================
   Boolean getEditFetch();

   //============================================================
   // <T>设置查询编辑可的内容。</T>
   //
   // @param value 查询编辑可
   //============================================================
   void setEditFetch(Boolean value);

   //============================================================
   // <T>获得搜索编辑可的内容。</T>
   //
   // @return 搜索编辑可
   //============================================================
   Boolean getEditSearch();

   //============================================================
   // <T>设置搜索编辑可的内容。</T>
   //
   // @param value 搜索编辑可
   //============================================================
   void setEditSearch(Boolean value);

   //============================================================
   // <T>获得选取编辑可的内容。</T>
   //
   // @return 选取编辑可
   //============================================================
   Boolean getEditPicker();

   //============================================================
   // <T>设置选取编辑可的内容。</T>
   //
   // @param value 选取编辑可
   //============================================================
   void setEditPicker(Boolean value);

   //============================================================
   // <T>获得放大编辑可的内容。</T>
   //
   // @return 放大编辑可
   //============================================================
   Boolean getEditZoom();

   //============================================================
   // <T>设置放大编辑可的内容。</T>
   //
   // @param value 放大编辑可
   //============================================================
   void setEditZoom(Boolean value);

   //============================================================
   // <T>获得打印编辑可的内容。</T>
   //
   // @return 打印编辑可
   //============================================================
   Boolean getEditPrint();

   //============================================================
   // <T>设置打印编辑可的内容。</T>
   //
   // @param value 打印编辑可
   //============================================================
   void setEditPrint(Boolean value);

   //============================================================
   // <T>获得操作编辑可的内容。</T>
   //
   // @return 操作编辑可
   //============================================================
   Boolean getEditAction();

   //============================================================
   // <T>设置操作编辑可的内容。</T>
   //
   // @param value 操作编辑可
   //============================================================
   void setEditAction(Boolean value);

   //============================================================
   // <T>获得新建编辑可的内容。</T>
   //
   // @return 新建编辑可
   //============================================================
   Boolean getEditInsert();

   //============================================================
   // <T>设置新建编辑可的内容。</T>
   //
   // @param value 新建编辑可
   //============================================================
   void setEditInsert(Boolean value);

   //============================================================
   // <T>获得修改编辑可的内容。</T>
   //
   // @return 修改编辑可
   //============================================================
   Boolean getEditUpdate();

   //============================================================
   // <T>设置修改编辑可的内容。</T>
   //
   // @param value 修改编辑可
   //============================================================
   void setEditUpdate(Boolean value);

   //============================================================
   // <T>获得删除编辑可的内容。</T>
   //
   // @return 删除编辑可
   //============================================================
   Boolean getEditDelete();

   //============================================================
   // <T>设置删除编辑可的内容。</T>
   //
   // @param value 删除编辑可
   //============================================================
   void setEditDelete(Boolean value);

   //============================================================
   // <T>获得检查权限的内容。</T>
   //
   // @return 检查权限
   //============================================================
   String getValidAccess();

   //============================================================
   // <T>设置检查权限的内容。</T>
   //
   // @param value 检查权限
   //============================================================
   void setValidAccess(String value);


   //============================================================
   // <T>获得新建检查可的内容。</T>
   //
   // @return 新建检查可
   //============================================================
   Boolean getValidInsert();

   //============================================================
   // <T>设置新建检查可的内容。</T>
   //
   // @param value 新建检查可
   //============================================================
   void setValidInsert(Boolean value);

   //============================================================
   // <T>获得更新检查可的内容。</T>
   //
   // @return 更新检查可
   //============================================================
   Boolean getValidUpdate();

   //============================================================
   // <T>设置更新检查可的内容。</T>
   //
   // @param value 更新检查可
   //============================================================
   void setValidUpdate(Boolean value);

   //============================================================
   // <T>获得删除检查可的内容。</T>
   //
   // @return 删除检查可
   //============================================================
   Boolean getValidDelete();

   //============================================================
   // <T>设置删除检查可的内容。</T>
   //
   // @param value 删除检查可
   //============================================================
   void setValidDelete(Boolean value);

   //============================================================
   // <T>获得新建处理的内容。</T>
   //
   // @return 新建处理
   //============================================================
   String getActionInsert();

   //============================================================
   // <T>设置新建处理的内容。</T>
   //
   // @param value 新建处理
   //============================================================
   void setActionInsert(String value);

   //============================================================
   // <T>获得更新处理的内容。</T>
   //
   // @return 更新处理
   //============================================================
   String getActionUpdate();

   //============================================================
   // <T>设置更新处理的内容。</T>
   //
   // @param value 更新处理
   //============================================================
   void setActionUpdate(String value);

   //============================================================
   // <T>获得删除处理的内容。</T>
   //
   // @return 删除处理
   //============================================================
   String getActionDelete();

   //============================================================
   // <T>设置删除处理的内容。</T>
   //
   // @param value 删除处理
   //============================================================
   void setActionDelete(String value);

   //============================================================
   // <T>获得操作准备的内容。</T>
   //
   // @return 操作准备
   //============================================================
   String getActionPrepare();

   //============================================================
   // <T>设置操作准备的内容。</T>
   //
   // @param value 操作准备
   //============================================================
   void setActionPrepare(String value);

   //============================================================
   // <T>获得工具栏显示的内容。</T>
   //
   // @return 工具栏显示
   //============================================================
   Boolean getDispToolbar();

   //============================================================
   // <T>设置工具栏显示的内容。</T>
   //
   // @param value 工具栏显示
   //============================================================
   void setDispToolbar(Boolean value);

   //============================================================
   // <T>获得逻辑名称的内容。</T>
   //
   // @return 逻辑名称
   //============================================================
   String getLgName();

   //============================================================
   // <T>设置逻辑名称的内容。</T>
   //
   // @param value 逻辑名称
   //============================================================
   void setLgName(String value);
}