package org.mo.web.core.webform.control;

import org.mo.com.xml.IXmlObject;

//============================================================
// <T>日期控件接口对象的XML节点基类。</T>
//============================================================
public interface XDescCalendarFace
      extends IXmlObject
{
   // 名称定义
   String NAME = "MDescCalendar";

   // 数据格式的名称定义
   String PTY_EDIT_FORMAT = "edit_format";

   // 编辑对齐的名称定义
   String PTY_EDIT_ALIGN = "edit_align";

   //============================================================
   // <T>获得数据格式的内容。</T>
   //
   // @return 数据格式
   //============================================================
   String getEditFormat();

   //============================================================
   // <T>设置数据格式的内容。</T>
   //
   // @param value 数据格式
   //============================================================
   void setEditFormat(String value);

   //============================================================
   // <T>获得编辑对齐的内容。</T>
   //
   // @return 编辑对齐
   //============================================================
   String getEditAlign();

   //============================================================
   // <T>设置编辑对齐的内容。</T>
   //
   // @param value 编辑对齐
   //============================================================
   void setEditAlign(String value);
}