package org.mo.web.core.webform.control;

import org.mo.com.xml.IXmlObject;

//============================================================
// <T>文本控件接口对象的XML节点基类。</T>
//============================================================
public interface XDescEditFace
      extends IXmlObject
{
   // 名称定义
   String NAME = "MDescEdit";

   // 编辑父的名称定义
   String PTY_EDIT_PARENT = "edit_parent";

   // 自动完成的名称定义
   String PTY_EDIT_COMPLETE = "edit_complete";

   // 编辑对齐的名称定义
   String PTY_EDIT_ALIGN = "edit_align";

   // 编辑长度的名称定义
   String PTY_EDIT_LENGTH = "edit_length";

   // 输入格式的名称定义
   String PTY_EDIT_CASE = "edit_case";

   // 输入模板的名称定义
   String PTY_EDIT_PATTERN = "edit_pattern";

   // 编辑格式的名称定义
   String PTY_EDIT_FORMAT = "edit_format";

   // 最大长度的名称定义
   String PTY_VALID_LENMAX = "valid_lenmax";

   //============================================================
   // <T>获得编辑父的内容。</T>
   //
   // @return 编辑父
   //============================================================
   String getEditParent();

   //============================================================
   // <T>设置编辑父的内容。</T>
   //
   // @param value 编辑父
   //============================================================
   void setEditParent(String value);

   //============================================================
   // <T>获得自动完成的内容。</T>
   //
   // @return 自动完成
   //============================================================
   Boolean getEditComplete();

   //============================================================
   // <T>设置自动完成的内容。</T>
   //
   // @param value 自动完成
   //============================================================
   void setEditComplete(Boolean value);

   //============================================================
   // <T>获得编辑对齐的内容。</T>
   //
   // @return 编辑对齐
   //============================================================
   String getEditAlign();

   //============================================================
   // <T>设置编辑对齐的内容。</T>
   //
   // @param value 编辑对齐
   //============================================================
   void setEditAlign(String value);

   //============================================================
   // <T>获得编辑长度的内容。</T>
   //
   // @return 编辑长度
   //============================================================
   String getEditLength();

   //============================================================
   // <T>设置编辑长度的内容。</T>
   //
   // @param value 编辑长度
   //============================================================
   void setEditLength(String value);

   //============================================================
   // <T>获得输入格式的内容。</T>
   //
   // @return 输入格式
   //============================================================
   String getEditCase();

   //============================================================
   // <T>设置输入格式的内容。</T>
   //
   // @param value 输入格式
   //============================================================
   void setEditCase(String value);

   //============================================================
   // <T>获得输入模板的内容。</T>
   //
   // @return 输入模板
   //============================================================
   String getEditPattern();

   //============================================================
   // <T>设置输入模板的内容。</T>
   //
   // @param value 输入模板
   //============================================================
   void setEditPattern(String value);

   //============================================================
   // <T>获得编辑格式的内容。</T>
   //
   // @return 编辑格式
   //============================================================
   String getEditFormat();

   //============================================================
   // <T>设置编辑格式的内容。</T>
   //
   // @param value 编辑格式
   //============================================================
   void setEditFormat(String value);

   //============================================================
   // <T>获得最大长度的内容。</T>
   //
   // @return 最大长度
   //============================================================
   String getValidLenmax();

   //============================================================
   // <T>设置最大长度的内容。</T>
   //
   // @param value 最大长度
   //============================================================
   void setValidLenmax(String value);
}