package org.mo.web.core.webform.control;

import org.mo.com.xml.IXmlObject;

//============================================================
// <T>控制显示接口对象的XML节点基类。</T>
//============================================================
public interface XDisplayFace
      extends IXmlObject
{
   // 名称定义
   String NAME = "MDisplay";

   // 显示模式的名称定义
   String PTY_DISP_MODE = "disp_mode";

   // 显示设置的名称定义
   String PTY_DISP_CONFIG = "disp_config";

   // 查询的名称定义
   String PTY_DISP_FETCH = "disp_fetch";

   // 搜索显示的名称定义
   String PTY_DISP_SEARCH = "disp_search";

   // 选取显示的名称定义
   String PTY_DISP_PICKER = "disp_picker";

   // LOV显示的名称定义
   String PTY_DISP_LOV = "disp_lov";

   // 放大显示的名称定义
   String PTY_DISP_ZOOM = "disp_zoom";

   // 列表显示的名称定义
   String PTY_DISP_LIST = "disp_list";

   // 显示显示的名称定义
   String PTY_DISP_DISPLAY = "disp_display";

   // 新建显示的名称定义
   String PTY_DISP_INSERT = "disp_insert";

   // 更新显示的名称定义
   String PTY_DISP_UPDATE = "disp_update";

   // 删除显示的名称定义
   String PTY_DISP_DELETE = "disp_delete";

   // 自动调整的名称定义
   String PTY_DISP_AUTO = "disp_auto";

   // 可变大小的名称定义
   String PTY_DISP_SIZE = "disp_size";

   // 可被拖拽的名称定义
   String PTY_DISP_DRAG = "disp_drag";

   // 印刷显示的名称定义
   String PTY_DISP_PRINT = "disp_print";

   //============================================================
   // <T>获得显示模式的内容。</T>
   //
   // @return 显示模式
   //============================================================
   String getDispMode();

   //============================================================
   // <T>设置显示模式的内容。</T>
   //
   // @param value 显示模式
   //============================================================
   void setDispMode(String value);


   //============================================================
   // <T>获得显示设置的内容。</T>
   //
   // @return 显示设置
   //============================================================
   String getDispConfig();

   //============================================================
   // <T>设置显示设置的内容。</T>
   //
   // @param value 显示设置
   //============================================================
   void setDispConfig(String value);


   //============================================================
   // <T>获得查询的内容。</T>
   //
   // @return 查询
   //============================================================
   Boolean getDispFetch();

   //============================================================
   // <T>设置查询的内容。</T>
   //
   // @param value 查询
   //============================================================
   void setDispFetch(Boolean value);

   //============================================================
   // <T>获得搜索显示的内容。</T>
   //
   // @return 搜索显示
   //============================================================
   Boolean getDispSearch();

   //============================================================
   // <T>设置搜索显示的内容。</T>
   //
   // @param value 搜索显示
   //============================================================
   void setDispSearch(Boolean value);

   //============================================================
   // <T>获得选取显示的内容。</T>
   //
   // @return 选取显示
   //============================================================
   Boolean getDispPicker();

   //============================================================
   // <T>设置选取显示的内容。</T>
   //
   // @param value 选取显示
   //============================================================
   void setDispPicker(Boolean value);

   //============================================================
   // <T>获得LOV显示的内容。</T>
   //
   // @return LOV显示
   //============================================================
   Boolean getDispLov();

   //============================================================
   // <T>设置LOV显示的内容。</T>
   //
   // @param value LOV显示
   //============================================================
   void setDispLov(Boolean value);

   //============================================================
   // <T>获得放大显示的内容。</T>
   //
   // @return 放大显示
   //============================================================
   Boolean getDispZoom();

   //============================================================
   // <T>设置放大显示的内容。</T>
   //
   // @param value 放大显示
   //============================================================
   void setDispZoom(Boolean value);

   //============================================================
   // <T>获得列表显示的内容。</T>
   //
   // @return 列表显示
   //============================================================
   Boolean getDispList();

   //============================================================
   // <T>设置列表显示的内容。</T>
   //
   // @param value 列表显示
   //============================================================
   void setDispList(Boolean value);

   //============================================================
   // <T>获得显示显示的内容。</T>
   //
   // @return 显示显示
   //============================================================
   Boolean getDispDisplay();

   //============================================================
   // <T>设置显示显示的内容。</T>
   //
   // @param value 显示显示
   //============================================================
   void setDispDisplay(Boolean value);

   //============================================================
   // <T>获得新建显示的内容。</T>
   //
   // @return 新建显示
   //============================================================
   Boolean getDispInsert();

   //============================================================
   // <T>设置新建显示的内容。</T>
   //
   // @param value 新建显示
   //============================================================
   void setDispInsert(Boolean value);

   //============================================================
   // <T>获得更新显示的内容。</T>
   //
   // @return 更新显示
   //============================================================
   Boolean getDispUpdate();

   //============================================================
   // <T>设置更新显示的内容。</T>
   //
   // @param value 更新显示
   //============================================================
   void setDispUpdate(Boolean value);

   //============================================================
   // <T>获得删除显示的内容。</T>
   //
   // @return 删除显示
   //============================================================
   Boolean getDispDelete();

   //============================================================
   // <T>设置删除显示的内容。</T>
   //
   // @param value 删除显示
   //============================================================
   void setDispDelete(Boolean value);

   //============================================================
   // <T>获得自动调整的内容。</T>
   //
   // @return 自动调整
   //============================================================
   Boolean getDispAuto();

   //============================================================
   // <T>设置自动调整的内容。</T>
   //
   // @param value 自动调整
   //============================================================
   void setDispAuto(Boolean value);

   //============================================================
   // <T>获得可变大小的内容。</T>
   //
   // @return 可变大小
   //============================================================
   Boolean getDispSize();

   //============================================================
   // <T>设置可变大小的内容。</T>
   //
   // @param value 可变大小
   //============================================================
   void setDispSize(Boolean value);

   //============================================================
   // <T>获得可被拖拽的内容。</T>
   //
   // @return 可被拖拽
   //============================================================
   Boolean getDispDrag();

   //============================================================
   // <T>设置可被拖拽的内容。</T>
   //
   // @param value 可被拖拽
   //============================================================
   void setDispDrag(Boolean value);

   //============================================================
   // <T>获得印刷显示的内容。</T>
   //
   // @return 印刷显示
   //============================================================
   Boolean getDispPrint();

   //============================================================
   // <T>设置印刷显示的内容。</T>
   //
   // @param value 印刷显示
   //============================================================
   void setDispPrint(Boolean value);
}