package org.mo.web.core.webform.control;

import org.mo.com.xml.IXmlObject;

//============================================================
// <T>编辑信息接口对象的XML节点基类。</T>
//============================================================
public interface XEditDescriptorFace
      extends IXmlObject
{
   // 名称定义
   String NAME = "MEditDescriptor";

   // 对齐方式的名称定义
   String PTY_LABEL_ALIGN = "label_align";

   // 标签颜色的名称定义
   String PTY_LABEL_COLOR = "label_color";

   // 标签图标的名称定义
   String PTY_LABEL_ICON = "label_icon";

   // 是否查询的名称定义
   String PTY_DATA_FETCH = "data_fetch";

   // 数据名称的名称定义
   String PTY_DATA_NAME = "data_name";

   // 数据代码的名称定义
   String PTY_DATA_CODE = "data_code";

   // 数据准备的名称定义
   String PTY_DATA_PREPARE = "data_prepare";

   // 缺省内容的名称定义
   String PTY_DATA_DEFAULT = "data_default";

   // 编辑模式的名称定义
   String PTY_EDIT_MODE = "edit_mode";

   // 编辑设置的名称定义
   String PTY_EDIT_CONFIG = "edit_config";

   // 搜索编辑可的名称定义
   String PTY_EDIT_SEARCH = "edit_search";

   // 新建编辑可的名称定义
   String PTY_EDIT_INSERT = "edit_insert";

   // 修改编辑可的名称定义
   String PTY_EDIT_UPDATE = "edit_update";

   // 删除编辑可的名称定义
   String PTY_EDIT_DELETE = "edit_delete";

   // 放大编辑可的名称定义
   String PTY_EDIT_ZOOM = "edit_zoom";

   // 计量单位的名称定义
   String PTY_EDIT_UNIT = "edit_unit";

   // 编辑提示的名称定义
   String PTY_EDIT_TIP = "edit_tip";

   // 复制可的名称定义
   String PTY_EDIT_COPY = "edit_copy";

   // 检查权限的名称定义
   String PTY_VALID_ACCESS = "valid_access";

   // 新建检查可的名称定义
   String PTY_VALID_INSERT = "valid_insert";

   // 更新检查可的名称定义
   String PTY_VALID_UPDATE = "valid_update";

   // 删除检查可的名称定义
   String PTY_VALID_DELETE = "valid_delete";

   // 检查必须的名称定义
   String PTY_VALID_REQUIRE = "valid_require";

   //============================================================
   // <T>获得对齐方式的内容。</T>
   //
   // @return 对齐方式
   //============================================================
   String getLabelAlign();

   //============================================================
   // <T>设置对齐方式的内容。</T>
   //
   // @param value 对齐方式
   //============================================================
   void setLabelAlign(String value);

   //============================================================
   // <T>获得标签颜色的内容。</T>
   //
   // @return 标签颜色
   //============================================================
   String getLabelColor();

   //============================================================
   // <T>设置标签颜色的内容。</T>
   //
   // @param value 标签颜色
   //============================================================
   void setLabelColor(String value);

   //============================================================
   // <T>获得标签图标的内容。</T>
   //
   // @return 标签图标
   //============================================================
   String getLabelIcon();

   //============================================================
   // <T>设置标签图标的内容。</T>
   //
   // @param value 标签图标
   //============================================================
   void setLabelIcon(String value);

   //============================================================
   // <T>获得是否查询的内容。</T>
   //
   // @return 是否查询
   //============================================================
   Boolean getDataFetch();

   //============================================================
   // <T>设置是否查询的内容。</T>
   //
   // @param value 是否查询
   //============================================================
   void setDataFetch(Boolean value);

   //============================================================
   // <T>获得数据名称的内容。</T>
   //
   // @return 数据名称
   //============================================================
   String getDataName();

   //============================================================
   // <T>设置数据名称的内容。</T>
   //
   // @param value 数据名称
   //============================================================
   void setDataName(String value);

   //============================================================
   // <T>获得数据代码的内容。</T>
   //
   // @return 数据代码
   //============================================================
   String getDataCode();

   //============================================================
   // <T>设置数据代码的内容。</T>
   //
   // @param value 数据代码
   //============================================================
   void setDataCode(String value);

   //============================================================
   // <T>获得数据准备的内容。</T>
   //
   // @return 数据准备
   //============================================================
   String getDataPrepare();

   //============================================================
   // <T>设置数据准备的内容。</T>
   //
   // @param value 数据准备
   //============================================================
   void setDataPrepare(String value);

   //============================================================
   // <T>获得缺省内容的内容。</T>
   //
   // @return 缺省内容
   //============================================================
   String getDataDefault();

   //============================================================
   // <T>设置缺省内容的内容。</T>
   //
   // @param value 缺省内容
   //============================================================
   void setDataDefault(String value);

   //============================================================
   // <T>获得编辑模式的内容。</T>
   //
   // @return 编辑模式
   //============================================================
   String getEditMode();

   //============================================================
   // <T>设置编辑模式的内容。</T>
   //
   // @param value 编辑模式
   //============================================================
   void setEditMode(String value);


   //============================================================
   // <T>获得编辑设置的内容。</T>
   //
   // @return 编辑设置
   //============================================================
   String getEditConfig();

   //============================================================
   // <T>设置编辑设置的内容。</T>
   //
   // @param value 编辑设置
   //============================================================
   void setEditConfig(String value);


   //============================================================
   // <T>获得搜索编辑可的内容。</T>
   //
   // @return 搜索编辑可
   //============================================================
   Boolean getEditSearch();

   //============================================================
   // <T>设置搜索编辑可的内容。</T>
   //
   // @param value 搜索编辑可
   //============================================================
   void setEditSearch(Boolean value);

   //============================================================
   // <T>获得新建编辑可的内容。</T>
   //
   // @return 新建编辑可
   //============================================================
   Boolean getEditInsert();

   //============================================================
   // <T>设置新建编辑可的内容。</T>
   //
   // @param value 新建编辑可
   //============================================================
   void setEditInsert(Boolean value);

   //============================================================
   // <T>获得修改编辑可的内容。</T>
   //
   // @return 修改编辑可
   //============================================================
   Boolean getEditUpdate();

   //============================================================
   // <T>设置修改编辑可的内容。</T>
   //
   // @param value 修改编辑可
   //============================================================
   void setEditUpdate(Boolean value);

   //============================================================
   // <T>获得删除编辑可的内容。</T>
   //
   // @return 删除编辑可
   //============================================================
   Boolean getEditDelete();

   //============================================================
   // <T>设置删除编辑可的内容。</T>
   //
   // @param value 删除编辑可
   //============================================================
   void setEditDelete(Boolean value);

   //============================================================
   // <T>获得放大编辑可的内容。</T>
   //
   // @return 放大编辑可
   //============================================================
   String getEditZoom();

   //============================================================
   // <T>设置放大编辑可的内容。</T>
   //
   // @param value 放大编辑可
   //============================================================
   void setEditZoom(String value);

   //============================================================
   // <T>获得计量单位的内容。</T>
   //
   // @return 计量单位
   //============================================================
   String getEditUnit();

   //============================================================
   // <T>设置计量单位的内容。</T>
   //
   // @param value 计量单位
   //============================================================
   void setEditUnit(String value);

   //============================================================
   // <T>获得编辑提示的内容。</T>
   //
   // @return 编辑提示
   //============================================================
   String getEditTip();

   //============================================================
   // <T>设置编辑提示的内容。</T>
   //
   // @param value 编辑提示
   //============================================================
   void setEditTip(String value);

   //============================================================
   // <T>获得复制可的内容。</T>
   //
   // @return 复制可
   //============================================================
   Boolean getEditCopy();

   //============================================================
   // <T>设置复制可的内容。</T>
   //
   // @param value 复制可
   //============================================================
   void setEditCopy(Boolean value);

   //============================================================
   // <T>获得检查权限的内容。</T>
   //
   // @return 检查权限
   //============================================================
   String getValidAccess();

   //============================================================
   // <T>设置检查权限的内容。</T>
   //
   // @param value 检查权限
   //============================================================
   void setValidAccess(String value);


   //============================================================
   // <T>获得新建检查可的内容。</T>
   //
   // @return 新建检查可
   //============================================================
   Boolean getValidInsert();

   //============================================================
   // <T>设置新建检查可的内容。</T>
   //
   // @param value 新建检查可
   //============================================================
   void setValidInsert(Boolean value);

   //============================================================
   // <T>获得更新检查可的内容。</T>
   //
   // @return 更新检查可
   //============================================================
   Boolean getValidUpdate();

   //============================================================
   // <T>设置更新检查可的内容。</T>
   //
   // @param value 更新检查可
   //============================================================
   void setValidUpdate(Boolean value);

   //============================================================
   // <T>获得删除检查可的内容。</T>
   //
   // @return 删除检查可
   //============================================================
   Boolean getValidDelete();

   //============================================================
   // <T>设置删除检查可的内容。</T>
   //
   // @param value 删除检查可
   //============================================================
   void setValidDelete(Boolean value);

   //============================================================
   // <T>获得检查必须的内容。</T>
   //
   // @return 检查必须
   //============================================================
   Boolean getValidRequire();

   //============================================================
   // <T>设置检查必须的内容。</T>
   //
   // @param value 检查必须
   //============================================================
   void setValidRequire(Boolean value);
}