package org.mo.web.core.webform.control;

import org.mo.com.xml.IXmlObject;

//============================================================
// <T>选取控件对象的XML节点基类。</T>
//============================================================
public interface XListViewFace
      extends IXmlObject
{
   // 名称定义
   String NAME = "MListView";

   // 选取服务的名称定义
   String PTY_LOV_SERVICE = "lov_service";

   // 选取引用的名称定义
   String PTY_LOV_REFER = "lov_refer";

   // 选取字段的名称定义
   String PTY_LOV_FIELDS = "lov_fields";

   // 选取条件的名称定义
   String PTY_LOV_WHERE = "lov_where";

   // 选取顺序的名称定义
   String PTY_LOV_ORDER = "lov_order";

   //============================================================
   // <T>获得选取服务的内容。</T>
   //
   // @return 选取服务
   //============================================================
   String getLovService();

   //============================================================
   // <T>设置选取服务的内容。</T>
   //
   // @param value 选取服务
   //============================================================
   void setLovService(String value);

   //============================================================
   // <T>获得选取引用的内容。</T>
   //
   // @return 选取引用
   //============================================================
   String getLovRefer();

   //============================================================
   // <T>设置选取引用的内容。</T>
   //
   // @param value 选取引用
   //============================================================
   void setLovRefer(String value);

   //============================================================
   // <T>获得选取字段的内容。</T>
   //
   // @return 选取字段
   //============================================================
   String getLovFields();

   //============================================================
   // <T>设置选取字段的内容。</T>
   //
   // @param value 选取字段
   //============================================================
   void setLovFields(String value);

   //============================================================
   // <T>获得选取条件的内容。</T>
   //
   // @return 选取条件
   //============================================================
   String getLovWhere();

   //============================================================
   // <T>设置选取条件的内容。</T>
   //
   // @param value 选取条件
   //============================================================
   void setLovWhere(String value);

   //============================================================
   // <T>获得选取顺序的内容。</T>
   //
   // @return 选取顺序
   //============================================================
   String getLovOrder();

   //============================================================
   // <T>设置选取顺序的内容。</T>
   //
   // @param value 选取顺序
   //============================================================
   void setLovOrder(String value);
}