package org.mo.web.core.webform.control;

import org.mo.com.xml.IXmlObject;

//============================================================
// <T>控件空余接口对象的XML节点基类。</T>
//============================================================
public interface XPadFace
      extends IXmlObject
{
   // 名称定义
   String NAME = "MPad";

   // 左空余的名称定义
   String PTY_PAD_LEFT = "pad_left";

   // 上空余的名称定义
   String PTY_PAD_TOP = "pad_top";

   // 下空余的名称定义
   String PTY_PAD_BOTTOM = "pad_bottom";

   // 右空余的名称定义
   String PTY_PAD_RIGHT = "pad_right";

   //============================================================
   // <T>获得左空余的内容。</T>
   //
   // @return 左空余
   //============================================================
   String getPadLeft();

   //============================================================
   // <T>设置左空余的内容。</T>
   //
   // @param value 左空余
   //============================================================
   void setPadLeft(String value);

   //============================================================
   // <T>获得上空余的内容。</T>
   //
   // @return 上空余
   //============================================================
   String getPadTop();

   //============================================================
   // <T>设置上空余的内容。</T>
   //
   // @param value 上空余
   //============================================================
   void setPadTop(String value);

   //============================================================
   // <T>获得下空余的内容。</T>
   //
   // @return 下空余
   //============================================================
   String getPadBottom();

   //============================================================
   // <T>设置下空余的内容。</T>
   //
   // @param value 下空余
   //============================================================
   void setPadBottom(String value);

   //============================================================
   // <T>获得右空余的内容。</T>
   //
   // @return 右空余
   //============================================================
   String getPadRight();

   //============================================================
   // <T>设置右空余的内容。</T>
   //
   // @param value 右空余
   //============================================================
   void setPadRight(String value);
}