package org.mo.web.core.webform.control;

import org.mo.com.xml.IXmlObject;

//============================================================
// <T>放大镜接口对象的XML节点基类。</T>
//============================================================
public interface XZoomFace
      extends IXmlObject
{
   // 名称定义
   String NAME = "MZoom";

   // 引用表单的名称定义
   String PTY_ZOOM_REFER = "zoom_refer";

   // 放大字段的名称定义
   String PTY_ZOOM_FIELD = "zoom_field";

   //============================================================
   // <T>获得引用表单的内容。</T>
   //
   // @return 引用表单
   //============================================================
   String getZoomRefer();

   //============================================================
   // <T>设置引用表单的内容。</T>
   //
   // @param value 引用表单
   //============================================================
   void setZoomRefer(String value);

   //============================================================
   // <T>获得放大字段的内容。</T>
   //
   // @return 放大字段
   //============================================================
   String getZoomField();

   //============================================================
   // <T>设置放大字段的内容。</T>
   //
   // @param value 放大字段
   //============================================================
   void setZoomField(String value);
}