package org.mo.game.editor.core.dataset.common;

import org.mo.com.xml.IXmlObject;

//============================================================
// <T>权限对象对象的XML节点基类。</T>
//============================================================
public interface XAccessFace
      extends IXmlObject
{
   // 名称定义
   String NAME = "IAccess";

   // 查询可的名称定义
   String PTY_ACCESS_QUERY = "access_query";

   // 新建可的名称定义
   String PTY_ACCESS_INSERT = "access_insert";

   // 更新可的名称定义
   String PTY_ACCESS_UPDATE = "access_update";

   // 删除可的名称定义
   String PTY_ACCESS_DELETE = "access_delete";

   //============================================================
   // <T>获得查询可的内容。</T>
   //
   // @return 查询可
   //============================================================
   String getAccessQuery();

   //============================================================
   // <T>设置查询可的内容。</T>
   //
   // @param value 查询可
   //============================================================
   void setAccessQuery(String value);

   //============================================================
   // <T>获得新建可的内容。</T>
   //
   // @return 新建可
   //============================================================
   Boolean getAccessInsert();

   //============================================================
   // <T>设置新建可的内容。</T>
   //
   // @param value 新建可
   //============================================================
   void setAccessInsert(Boolean value);

   //============================================================
   // <T>获得更新可的内容。</T>
   //
   // @return 更新可
   //============================================================
   Boolean getAccessUpdate();

   //============================================================
   // <T>设置更新可的内容。</T>
   //
   // @param value 更新可
   //============================================================
   void setAccessUpdate(Boolean value);

   //============================================================
   // <T>获得删除可的内容。</T>
   //
   // @return 删除可
   //============================================================
   Boolean getAccessDelete();

   //============================================================
   // <T>设置删除可的内容。</T>
   //
   // @param value 删除可
   //============================================================
   void setAccessDelete(Boolean value);
}