#include "MoCrCsv.h"

MO_NAMESPACE_BEGIN

//============================================================
//<T>构造表头一项</T>
//============================================================
FCsvHead::FCsvHead(){ 
   _index = ENotFound; 
}

//============================================================
//<T>销毁表头一项</T>
//============================================================
FCsvHead::~FCsvHead(){

}

//============================================================
//<T>获取表头项在表头中的索引。</T>
//
// @return 表头项在表头中的索引。
//============================================================
TInt FCsvHead::Index(){
   return _index;                 
}

//============================================================
//<T>获取表头项的名称。</T>
//
// @return 头项的名称。
//============================================================
TCharC* FCsvHead::Name(){ 
   return (TCharC*)_name;         
}

//============================================================
//<T>获取表头项的标题。</T>
//
// @return 头项的标题。
//============================================================
TCharC* FCsvHead::Label(){ 
   return (TCharC*)_label;        
}

//============================================================
//<T>获取表头项的描述。</T>
//
// @return 头项的描述。
//============================================================
TCharC* FCsvHead::Description(){ return (TCharC*)_description;  
}

//============================================================
//<T>设置表头项在表头中的索引。</T>
//
// @param index 表头项在表头中的索引。
//============================================================
void FCsvHead::SetIndex(TInt index){ 
   _index = index;                
}

//============================================================
//<T>设置表头项的名字。</T>
//
// @param name 表头项的名字。
//============================================================
void FCsvHead::SetName(TCharC* name){ 
   _name = name;                  
}

//============================================================
//<T>设置表头项的标题。</T>
//
// @param label 表头项的标题。
//============================================================
void FCsvHead::SetLabel(TCharC* label){ 
   _label = label;                
}

//============================================================
//<T>设置表头项的描述。</T>
//
// @param description 表头项的描述。
//============================================================
void FCsvHead::SetDescription(TCharC* description){ 
   _description = description;    
}

MO_NAMESPACE_END
