#include "MoCrWorker.h"

MO_NAMESPACE_BEGIN

//============================================================
// <T>构造工作器。</T>
//============================================================
FWorker::FWorker(){
   _statusCd = EWorkerStatus_Unknown;
}

//============================================================
// <T>析构工作器。</T>
//============================================================
FWorker::~FWorker(){
}

//============================================================
// <T>成功处理。</T>
//
// @return 处理结果
//============================================================
TResult FWorker::OnSuccess(){
   return ESuccess;
}

//============================================================
// <T>失败处理。</T>
//
// @return 处理结果
//============================================================
TResult FWorker::OnFailure(){
   return ESuccess;
}

//============================================================
// <T>逻辑处理。</T>
//
// @return 处理结果
//============================================================
TResult FWorker::Process(){
   TResult result = OnProcess();
   if(result){
      // 成功处理
      OnSuccess();
   }else{
      // 失败处理
      OnFailure();
   }
   return result;
}

MO_NAMESPACE_END
