package org.mo.eng.persistence.common;

import org.mo.com.xml.IXmlObject;

//============================================================
// <T>接口的XML节点基类。</T>
//
// @author system
//============================================================
public interface XObjectFace
      extends
         IXmlObject
{
   // 名称
   String NAME = "IObject";

   // 名称的名称定义
   String PTY_NAME = "name";

   // 标签的名称定义
   String PTY_LABEL = "label";

   // 有效性的名称定义
   String PTY_IS_VALID = "is_valid";

   // 描述信息的名称定义
   String PTY_NOTE = "note";

   // 附加属性的名称定义
   String PTY_ATTRIBUTES = "attributes";

   //============================================================
   // <T>获得名称的内容。</T>
   //
   // @return 名称
   //============================================================
   String getName();

   //============================================================
   // <T>设置名称的内容。</T>
   //
   // @param value 名称
   //============================================================
   void setName(String value);

   //============================================================
   // <T>获得标签的内容。</T>
   //
   // @return 标签
   //============================================================
   public String getLabel();

   //============================================================
   // <T>设置标签的内容。</T>
   //
   // @param value 标签
   //============================================================
   void setLabel(String value);

   //============================================================
   // <T>获得有效性的内容。</T>
   //
   // @return 有效性
   //============================================================
   Boolean getIsValid();

   //============================================================
   // <T>设置有效性的内容。</T>
   //
   // @param value 有效性
   //============================================================
   void setIsValid(Boolean value);

   //============================================================
   // <T>获得描述信息的内容。</T>
   //
   // @return 描述信息
   //============================================================
   public String getNote();

   //============================================================
   // <T>设置描述信息的内容。</T>
   //
   // @param value 描述信息
   //============================================================
   void setNote(String value);

   //============================================================
   // <T>获得附加属性的内容。</T>
   //
   // @return 附加属性
   //============================================================
   String getAttributes();

   //============================================================
   // <T>设置附加属性的内容。</T>
   //
   // @param value 附加属性
   //============================================================
   void setAttributes(String value);
}
