#include "Mo3dsDefine.h"
#include "Mo3dsExport.h"

//============================================================
// <T>获得是否公开。</T>
//
// @return 是否公开
//============================================================
TInt32 T3dsClassDesc::IsPublic(){
   return ETrue;
}

//============================================================
// <T>获得父类对象。</T>
// <P>表示自己是导出插件。</P>
//
// @return 父类对象
//============================================================
SClass_ID T3dsClassDesc::SuperClassID(){
   return SCENE_EXPORT_CLASS_ID;
}

//============================================================
// <T>获得当前类编号。</T>
//
// @return 编号
//============================================================
Class_ID T3dsClassDesc::ClassID(){
   return MO_3E_CLASS;
}

//============================================================
// <T>获得分类名称。</T>
//
// @return 分类名称
//============================================================
TCharC* T3dsClassDesc::Category(){
   return MO_3E_CATEGORY;
}

//============================================================
// <T>获得类名。</T>
//
// @return 类名
//============================================================
TCharC* T3dsClassDesc::ClassName(){
   return MO_3E_NAME;
}

//============================================================
// <T>创建导出器实体。</T>
//
// @param loading 加载标志
// @return 导出器实体
//============================================================
TAny* T3dsClassDesc::Create(TInt32 loading){
   return MO_PTR_CREATE(F3dsSceneExport);
}
