package org.mo.com.geom;

import org.mo.com.lang.RInteger;

//============================================================
// <T>二维整数坐标。</T>
//============================================================
public class SIntPoint2
{
   // 横坐标
   public int x;

   // 纵坐标
   public int y;

   //============================================================
   // <T>构造二维整数坐标。</T>
   //============================================================
   public SIntPoint2(){
   }

   //============================================================
   // <T>构造二维整数坐标。</T>
   //
   // @param xValue 横坐标
   // @param yValue 纵坐标
   //============================================================
   public SIntPoint2(int xValue,
                     int yValue){
      x = xValue;
      y = yValue;
   }

   //============================================================
   // <T>判断是否为空。</T>
   //
   // @return 是否为空
   //============================================================
   public boolean isEmpty(){
      return (0 == x) && (0 == y);
   }

   //============================================================
   // <T>判断是否相等。</T>
   //
   // @param value 内容
   // @return 是否相等
   //============================================================
   public boolean equals(SIntPoint2 value){
      return (x == value.x) && (y == value.y);
   }

   //============================================================
   // <T>接收二维坐标。</T>
   //
   // @param p:value 二维坐标
   //============================================================
   public void assign(SIntPoint2 value){
      x = value.x;
      y = value.y;
   }

   //============================================================
   // <T>设置坐标。</T>
   //
   // @param px 横坐标
   // @param py 横坐标
   //============================================================
   public void set(int px,
                   int py){
      x = px;
      y = py;
   }

   //============================================================
   // <T>解析字符串。</T>
   //
   // @param value 字符串
   //============================================================
   public void parse(String value){
      if(null != value){
         if(value.length() > 0){
            int index = value.indexOf(",");
            if(-1 != index){
               x = RInteger.parse(value.substring(0, index));
               y = RInteger.parse(value.substring(index + 1));
            }else{
               x = y = RInteger.parse(value);
            }
         }
      }
   }

   //============================================================
   // <T>获得字符串。</T>
   //
   // @return 字符串
   //============================================================
   public String toString(){
      return x + "," + y;
   }
}
