package org.mo.core.aop.config;

import org.mo.com.lang.IDump;
import org.mo.com.xml.FXmlNode;

//============================================================
// <T>AOP节点接口。</T>
//============================================================
public interface IAopNode
      extends
         IDump
{
   //============================================================
   // <T>获得键内容。</T>
   //
   // @return 键内容
   //============================================================
   String key();

   //============================================================
   // <T>加载XML设置信息。</T>
   //
   // @param xconfig 设置节点
   //============================================================
   void loadConfig(FXmlNode xconfig);
}
