#include "MoFrContent.h"

MO_NAMESPACE_BEGIN

MO_CLASS_IMPLEMENT_INHERITS(FContent, FInstance);

//============================================================
// <T>构造内容。</T>
//============================================================
FContent::FContent(){
   _statusReady = EFalse;
   _timeoutSpan = 0;
   _updateTick = 0;
}

//============================================================
// <T>析构内容。</T>
//============================================================
FContent::~FContent(){
}

//============================================================
// <T>测试是否准备好。</T>
//
// @return 是否准备好。</T>
//============================================================
TBool FContent::TestReady(){
   return _statusReady;
}

//============================================================
// <T>测试是否有效。</T>
//
// @return 是否有效
//============================================================
TBool FContent::TestValid(){
   return ETrue;
}

//============================================================
// <T>从输入流里反序列化信息内容</T>
//
// @param pInput 输入流
// @return 处理结果
//============================================================
TResult FContent::Unserialize(IDataInput* pInput){
   return ESuccess;
}

//============================================================
// <T>数据处理。</T>
//
// @return 处理结果
//============================================================
TResult FContent::Complete(){
   _statusReady = ETrue;
   return ESuccess;
}

//============================================================
// <T>数据处理。</T>
//
// @return 处理结果
//============================================================
TResult FContent::Process(){
   return ESuccess;
}

MO_NAMESPACE_END
