#include "MoFrLoader.h"

MO_NAMESPACE_BEGIN

//============================================================
// <T>构造文件加载器。</T>
//============================================================
FFileLoader::FFileLoader(){
   _sourceId = 0;
   _pByteFile = MO_CREATE(FByteFile);
}

//============================================================
// <T>析构文件加载器。</T>
//============================================================
FFileLoader::~FFileLoader(){
   MO_DELETE(_pByteFile);
}

//============================================================
// <T>加载文件。</T>
//============================================================
TBool FFileLoader::LoadFile(){
   return ETrue;
}

MO_NAMESPACE_END
