#include "MoFrContent2d.h"

MO_NAMESPACE_BEGIN

//============================================================
// <T>构造资源。</T>
//============================================================
FResource::FResource(){
   _typeCd = EResourceType_Unknown;
   _code = 0;
   _timeout = 0;
}

//============================================================
// <T>析构资源。</T>
//============================================================
FResource::~FResource(){
   MO_DEBUG_INFO(TC("Release resource. (code=%d)"), _code);
}

//============================================================
// <T>测试是否准备好。</T>
//
// @return 是否准备好。</T>
//============================================================
TBool FResource::TestReady(){
   return EFalse;
}

//============================================================
// <T>测试是否有效。</T>
//
// @return 是否有效
//============================================================
TBool FResource::TestValid(){
   return ETrue;
}

//============================================================
// <T>从输入流里反序列化信息内容</T>
//
// @param pInput 输入流
// @return 处理结果
//============================================================
TResult FResource::Unserialize(IDataInput* pInput){
   _code = pInput->ReadInt32();
   _timeout = pInput->ReadInt32();
   return ESuccess;
}

//============================================================
// <T>数据处理。</T>
//
// @return 处理结果
//============================================================
TBool FResource::Process(){
   return ETrue;
}

MO_NAMESPACE_END
