package com.zqinet.logic.data.game;

import org.mo.com.lang.*;
import org.mo.com.collections.*;
import org.mo.com.lang.type.*;
import org.mo.data.logic.*;

//============================================================
// <T>角色宠物信息逻辑单元。</T>
//============================================================
public class FGameRolePetUnit extends FLogicUnit
{
   // 存储字段对象标识的定义。
   private long __ouid;

   // 字段对象标识的定义。
   protected long _ouid;

   // 存储字段有效性的定义。
   private boolean __ovld;

   // 字段有效性的定义。
   protected boolean _ovld;

   // 存储字段唯一标识的定义。
   private int __uniqueId;

   // 字段唯一标识的定义。
   protected int _uniqueId;

   // 存储字段角色编号的定义。
   private long __roleId;

   // 字段角色编号的定义。
   protected long _roleId;

   // 存储字段宠物模板编号的定义。
   private int __petTid;

   // 字段宠物模板编号的定义。
   protected int _petTid;

   // 存储字段中文名称的定义。
   private String __label;

   // 字段中文名称的定义。
   protected String _label;

   // 存储字段种族模板编号的定义。
   private int __petRaceTid;

   // 字段种族模板编号的定义。
   protected int _petRaceTid;

   // 存储字段类别的定义。
   private int __petTypeTid;

   // 字段类别的定义。
   protected int _petTypeTid;

   // 存储字段宠物形象的定义。
   private int __petStyleTid;

   // 字段宠物形象的定义。
   protected int _petStyleTid;

   // 存储字段级别的定义。
   private int __level;

   // 字段级别的定义。
   protected int _level;

   // 存储字段寿命的定义。
   private int __life;

   // 字段寿命的定义。
   protected int _life;

   // 存储字段悟性的定义。
   private int __understanding;

   // 字段悟性的定义。
   protected int _understanding;

   // 存储字段移动速度的定义。
   private int __speed;

   // 字段移动速度的定义。
   protected int _speed;

   // 存储字段体质的定义。
   private int __vitality;

   // 字段体质的定义。
   protected int _vitality;

   // 存储字段力量的定义。
   private int __strength;

   // 字段力量的定义。
   protected int _strength;

   // 存储字段耐力的定义。
   private int __stamina;

   // 字段耐力的定义。
   protected int _stamina;

   // 存储字段魔力的定义。
   private int __magic;

   // 字段魔力的定义。
   protected int _magic;

   // 存储字段敏捷的定义。
   private int __agility;

   // 字段敏捷的定义。
   protected int _agility;

   // 存储字段魔法值的定义。
   private String __mp;

   // 字段魔法值的定义。
   protected String _mp;

   // 存储字段生命值的定义。
   private String __hp;

   // 字段生命值的定义。
   protected String _hp;

   // 存储字段气血资质的定义。
   private int __itgHp;

   // 字段气血资质的定义。
   protected int _itgHp;

   // 存储字段物攻资质的定义。
   private int __itgAttackPhysical;

   // 字段物攻资质的定义。
   protected int _itgAttackPhysical;

   // 存储字段物防资质的定义。
   private int __itgDefencePhysical;

   // 字段物防资质的定义。
   protected int _itgDefencePhysical;

   // 存储字段法攻资质的定义。
   private int __itgAttackMag;

   // 字段法攻资质的定义。
   protected int _itgAttackMag;

   // 存储字段法防资质的定义。
   private int __itgDefenMag;

   // 字段法防资质的定义。
   protected int _itgDefenMag;

   // 存储字段速度资质的定义。
   private int __itgMobility;

   // 字段速度资质的定义。
   protected int _itgMobility;

   // 存储字段成长的定义。
   private int __itgGrow;

   // 字段成长的定义。
   protected int _itgGrow;

   // 存储字段潜力点的定义。
   private int __potencyPoint;

   // 字段潜力点的定义。
   protected int _potencyPoint;

   // 存储字段潜力点道具使用次数的定义。
   private int __itemPotencyPointTiems;

   // 字段潜力点道具使用次数的定义。
   protected int _itemPotencyPointTiems;

   // 存储字段物理攻击力的定义。
   private int __attackPhysical;

   // 字段物理攻击力的定义。
   protected int _attackPhysical;

   // 存储字段魔法攻击力的定义。
   private int __attackMagic;

   // 字段魔法攻击力的定义。
   protected int _attackMagic;

   // 存储字段物理防御力的定义。
   private int __defencePhysical;

   // 字段物理防御力的定义。
   protected int _defencePhysical;

   // 存储字段魔法防御力的定义。
   private int __defenceMagic;

   // 字段魔法防御力的定义。
   protected int _defenceMagic;

   // 存储字段行动值的定义。
   private int __mobility;

   // 字段行动值的定义。
   protected int _mobility;

   // 存储字段命中值的定义。
   private int __hit;

   // 字段命中值的定义。
   protected int _hit;

   // 存储字段闪避值的定义。
   private int __dodge;

   // 字段闪避值的定义。
   protected int _dodge;

   // 存储字段暴击的定义。
   private int __critical;

   // 字段暴击的定义。
   protected int _critical;

   // 存储字段标志的定义。
   private int __flags;

   // 字段标志的定义。
   protected int _flags;

   // 存储字段五行的定义。
   private int __wuxing;

   // 字段五行的定义。
   protected int _wuxing;

   // 存储字段升级所需经验的定义。
   private int __experienceup;

   // 字段升级所需经验的定义。
   protected int _experienceup;

   // 存储字段经验的定义。
   private int __experience;

   // 字段经验的定义。
   protected int _experience;

   // 存储字段初始等级的定义。
   private int __initLevel;

   // 字段初始等级的定义。
   protected int _initLevel;

   // 存储字段初始体质的定义。
   private int __initVitality;

   // 字段初始体质的定义。
   protected int _initVitality;

   // 存储字段初始力量的定义。
   private int __initStrength;

   // 字段初始力量的定义。
   protected int _initStrength;

   // 存储字段初始耐力的定义。
   private int __initStamina;

   // 字段初始耐力的定义。
   protected int _initStamina;

   // 存储字段初始魔力的定义。
   private int __initMagic;

   // 字段初始魔力的定义。
   protected int _initMagic;

   // 存储字段初始敏捷的定义。
   private int __initAgility;

   // 字段初始敏捷的定义。
   protected int _initAgility;

   // 存储字段物品包类型的定义。
   private int __itemBagCd;

   // 字段物品包类型的定义。
   protected int _itemBagCd;

   // 存储字段物品背包编号的定义。
   private long __itemBagId;

   // 字段物品背包编号的定义。
   protected long _itemBagId;

   // 存储字段物品包索引的定义。
   private int __itemBagIndex;

   // 字段物品包索引的定义。
   protected int _itemBagIndex;

   // 存储字段物品快捷栏编号的定义。
   private long __itemBagShortcutId;

   // 字段物品快捷栏编号的定义。
   protected long _itemBagShortcutId;

   // 存储字段物品快捷栏索引的定义。
   private int __itemBagShortcutIndex;

   // 字段物品快捷栏索引的定义。
   protected int _itemBagShortcutIndex;

   // 存储字段出售开始时间的定义。
   private TDateTime __sellBeginDate = new TDateTime();

   // 字段出售开始时间的定义。
   protected TDateTime _sellBeginDate = new TDateTime();

   // 存储字段拍卖时间的定义。
   private int __auctionTimeCd;

   // 字段拍卖时间的定义。
   protected int _auctionTimeCd;

   // 存储字段金钱的定义。
   private String __currency;

   // 字段金钱的定义。
   protected String _currency;

   // 存储字段获得时间的定义。
   private TDateTime __obtainTime = new TDateTime();

   // 字段获得时间的定义。
   protected TDateTime _obtainTime = new TDateTime();

   // 存储字段卡牌信息的定义。
   private String __cardList;

   // 字段卡牌信息的定义。
   protected String _cardList;

   // 存储字段交易状态的定义。
   private int __tradeStatus;

   // 字段交易状态的定义。
   protected int _tradeStatus;

   // 存储字段创建用户标识的定义。
   private int __createUserId;

   // 字段创建用户标识的定义。
   protected int _createUserId;

   // 存储字段创建日期的定义。
   private TDateTime __createDate = new TDateTime();

   // 字段创建日期的定义。
   protected TDateTime _createDate = new TDateTime();

   // 存储字段更新者标识的定义。
   private int __updateUserId;

   // 字段更新者标识的定义。
   protected int _updateUserId;

   // 存储字段更新时间的定义。
   private TDateTime __updateDate = new TDateTime();

   // 字段更新时间的定义。
   protected TDateTime _updateDate = new TDateTime();

   //============================================================
   // <T>构造角色宠物信息逻辑单元。</T>
   //============================================================
   public FGameRolePetUnit(){
   }

   //============================================================
   // <T>判断对象标识的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isOuidChanged(){
      return __ouid != _ouid;
   }

   //============================================================
   // <T>获得对象标识的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public long ouid(){
      return _ouid;
   }

   //============================================================
   // <T>设置对象标识的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setOuid(long value){
      _ouid = value;
   }

   //============================================================
   // <T>判断有效性的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isOvldChanged(){
      return __ovld != _ovld;
   }

   //============================================================
   // <T>获得有效性的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean ovld(){
      return _ovld;
   }

   //============================================================
   // <T>设置有效性的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setOvld(boolean value){
      _ovld = value;
   }

   //============================================================
   // <T>判断唯一标识的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isUniqueIdChanged(){
      return __uniqueId != _uniqueId;
   }

   //============================================================
   // <T>获得唯一标识的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int uniqueId(){
      return _uniqueId;
   }

   //============================================================
   // <T>设置唯一标识的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setUniqueId(int value){
      _uniqueId = value;
   }

   //============================================================
   // <T>判断角色编号的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isRoleIdChanged(){
      return __roleId != _roleId;
   }

   //============================================================
   // <T>获得角色编号的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public long roleId(){
      return _roleId;
   }

   //============================================================
   // <T>设置角色编号的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setRoleId(long value){
      _roleId = value;
   }

   //============================================================
   // <T>判断宠物模板编号的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isPetTidChanged(){
      return __petTid != _petTid;
   }

   //============================================================
   // <T>获得宠物模板编号的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int petTid(){
      return _petTid;
   }

   //============================================================
   // <T>设置宠物模板编号的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setPetTid(int value){
      _petTid = value;
   }

   //============================================================
   // <T>判断中文名称的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isLabelChanged(){
      return !RString.equals(__label, _label);
   }

   //============================================================
   // <T>获得中文名称的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public String label(){
      return _label;
   }

   //============================================================
   // <T>设置中文名称的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setLabel(String value){
      _label = value;
   }

   //============================================================
   // <T>判断种族模板编号的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isPetRaceTidChanged(){
      return __petRaceTid != _petRaceTid;
   }

   //============================================================
   // <T>获得种族模板编号的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int petRaceTid(){
      return _petRaceTid;
   }

   //============================================================
   // <T>设置种族模板编号的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setPetRaceTid(int value){
      _petRaceTid = value;
   }

   //============================================================
   // <T>判断类别的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isPetTypeTidChanged(){
      return __petTypeTid != _petTypeTid;
   }

   //============================================================
   // <T>获得类别的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int petTypeTid(){
      return _petTypeTid;
   }

   //============================================================
   // <T>设置类别的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setPetTypeTid(int value){
      _petTypeTid = value;
   }

   //============================================================
   // <T>判断宠物形象的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isPetStyleTidChanged(){
      return __petStyleTid != _petStyleTid;
   }

   //============================================================
   // <T>获得宠物形象的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int petStyleTid(){
      return _petStyleTid;
   }

   //============================================================
   // <T>设置宠物形象的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setPetStyleTid(int value){
      _petStyleTid = value;
   }

   //============================================================
   // <T>判断级别的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isLevelChanged(){
      return __level != _level;
   }

   //============================================================
   // <T>获得级别的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int level(){
      return _level;
   }

   //============================================================
   // <T>设置级别的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setLevel(int value){
      _level = value;
   }

   //============================================================
   // <T>判断寿命的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isLifeChanged(){
      return __life != _life;
   }

   //============================================================
   // <T>获得寿命的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int life(){
      return _life;
   }

   //============================================================
   // <T>设置寿命的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setLife(int value){
      _life = value;
   }

   //============================================================
   // <T>判断悟性的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isUnderstandingChanged(){
      return __understanding != _understanding;
   }

   //============================================================
   // <T>获得悟性的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int understanding(){
      return _understanding;
   }

   //============================================================
   // <T>设置悟性的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setUnderstanding(int value){
      _understanding = value;
   }

   //============================================================
   // <T>判断移动速度的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isSpeedChanged(){
      return __speed != _speed;
   }

   //============================================================
   // <T>获得移动速度的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int speed(){
      return _speed;
   }

   //============================================================
   // <T>设置移动速度的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setSpeed(int value){
      _speed = value;
   }

   //============================================================
   // <T>判断体质的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isVitalityChanged(){
      return __vitality != _vitality;
   }

   //============================================================
   // <T>获得体质的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int vitality(){
      return _vitality;
   }

   //============================================================
   // <T>设置体质的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setVitality(int value){
      _vitality = value;
   }

   //============================================================
   // <T>判断力量的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isStrengthChanged(){
      return __strength != _strength;
   }

   //============================================================
   // <T>获得力量的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int strength(){
      return _strength;
   }

   //============================================================
   // <T>设置力量的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setStrength(int value){
      _strength = value;
   }

   //============================================================
   // <T>判断耐力的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isStaminaChanged(){
      return __stamina != _stamina;
   }

   //============================================================
   // <T>获得耐力的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int stamina(){
      return _stamina;
   }

   //============================================================
   // <T>设置耐力的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setStamina(int value){
      _stamina = value;
   }

   //============================================================
   // <T>判断魔力的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isMagicChanged(){
      return __magic != _magic;
   }

   //============================================================
   // <T>获得魔力的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int magic(){
      return _magic;
   }

   //============================================================
   // <T>设置魔力的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setMagic(int value){
      _magic = value;
   }

   //============================================================
   // <T>判断敏捷的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isAgilityChanged(){
      return __agility != _agility;
   }

   //============================================================
   // <T>获得敏捷的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int agility(){
      return _agility;
   }

   //============================================================
   // <T>设置敏捷的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setAgility(int value){
      _agility = value;
   }

   //============================================================
   // <T>判断魔法值的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isMpChanged(){
      return !RString.equals(__mp, _mp);
   }

   //============================================================
   // <T>获得魔法值的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public String mp(){
      return _mp;
   }

   //============================================================
   // <T>设置魔法值的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setMp(String value){
      _mp = value;
   }

   //============================================================
   // <T>判断生命值的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isHpChanged(){
      return !RString.equals(__hp, _hp);
   }

   //============================================================
   // <T>获得生命值的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public String hp(){
      return _hp;
   }

   //============================================================
   // <T>设置生命值的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setHp(String value){
      _hp = value;
   }

   //============================================================
   // <T>判断气血资质的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isItgHpChanged(){
      return __itgHp != _itgHp;
   }

   //============================================================
   // <T>获得气血资质的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int itgHp(){
      return _itgHp;
   }

   //============================================================
   // <T>设置气血资质的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setItgHp(int value){
      _itgHp = value;
   }

   //============================================================
   // <T>判断物攻资质的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isItgAttackPhysicalChanged(){
      return __itgAttackPhysical != _itgAttackPhysical;
   }

   //============================================================
   // <T>获得物攻资质的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int itgAttackPhysical(){
      return _itgAttackPhysical;
   }

   //============================================================
   // <T>设置物攻资质的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setItgAttackPhysical(int value){
      _itgAttackPhysical = value;
   }

   //============================================================
   // <T>判断物防资质的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isItgDefencePhysicalChanged(){
      return __itgDefencePhysical != _itgDefencePhysical;
   }

   //============================================================
   // <T>获得物防资质的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int itgDefencePhysical(){
      return _itgDefencePhysical;
   }

   //============================================================
   // <T>设置物防资质的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setItgDefencePhysical(int value){
      _itgDefencePhysical = value;
   }

   //============================================================
   // <T>判断法攻资质的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isItgAttackMagChanged(){
      return __itgAttackMag != _itgAttackMag;
   }

   //============================================================
   // <T>获得法攻资质的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int itgAttackMag(){
      return _itgAttackMag;
   }

   //============================================================
   // <T>设置法攻资质的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setItgAttackMag(int value){
      _itgAttackMag = value;
   }

   //============================================================
   // <T>判断法防资质的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isItgDefenMagChanged(){
      return __itgDefenMag != _itgDefenMag;
   }

   //============================================================
   // <T>获得法防资质的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int itgDefenMag(){
      return _itgDefenMag;
   }

   //============================================================
   // <T>设置法防资质的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setItgDefenMag(int value){
      _itgDefenMag = value;
   }

   //============================================================
   // <T>判断速度资质的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isItgMobilityChanged(){
      return __itgMobility != _itgMobility;
   }

   //============================================================
   // <T>获得速度资质的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int itgMobility(){
      return _itgMobility;
   }

   //============================================================
   // <T>设置速度资质的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setItgMobility(int value){
      _itgMobility = value;
   }

   //============================================================
   // <T>判断成长的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isItgGrowChanged(){
      return __itgGrow != _itgGrow;
   }

   //============================================================
   // <T>获得成长的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int itgGrow(){
      return _itgGrow;
   }

   //============================================================
   // <T>设置成长的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setItgGrow(int value){
      _itgGrow = value;
   }

   //============================================================
   // <T>判断潜力点的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isPotencyPointChanged(){
      return __potencyPoint != _potencyPoint;
   }

   //============================================================
   // <T>获得潜力点的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int potencyPoint(){
      return _potencyPoint;
   }

   //============================================================
   // <T>设置潜力点的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setPotencyPoint(int value){
      _potencyPoint = value;
   }

   //============================================================
   // <T>判断潜力点道具使用次数的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isItemPotencyPointTiemsChanged(){
      return __itemPotencyPointTiems != _itemPotencyPointTiems;
   }

   //============================================================
   // <T>获得潜力点道具使用次数的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int itemPotencyPointTiems(){
      return _itemPotencyPointTiems;
   }

   //============================================================
   // <T>设置潜力点道具使用次数的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setItemPotencyPointTiems(int value){
      _itemPotencyPointTiems = value;
   }

   //============================================================
   // <T>判断物理攻击力的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isAttackPhysicalChanged(){
      return __attackPhysical != _attackPhysical;
   }

   //============================================================
   // <T>获得物理攻击力的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int attackPhysical(){
      return _attackPhysical;
   }

   //============================================================
   // <T>设置物理攻击力的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setAttackPhysical(int value){
      _attackPhysical = value;
   }

   //============================================================
   // <T>判断魔法攻击力的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isAttackMagicChanged(){
      return __attackMagic != _attackMagic;
   }

   //============================================================
   // <T>获得魔法攻击力的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int attackMagic(){
      return _attackMagic;
   }

   //============================================================
   // <T>设置魔法攻击力的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setAttackMagic(int value){
      _attackMagic = value;
   }

   //============================================================
   // <T>判断物理防御力的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isDefencePhysicalChanged(){
      return __defencePhysical != _defencePhysical;
   }

   //============================================================
   // <T>获得物理防御力的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int defencePhysical(){
      return _defencePhysical;
   }

   //============================================================
   // <T>设置物理防御力的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setDefencePhysical(int value){
      _defencePhysical = value;
   }

   //============================================================
   // <T>判断魔法防御力的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isDefenceMagicChanged(){
      return __defenceMagic != _defenceMagic;
   }

   //============================================================
   // <T>获得魔法防御力的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int defenceMagic(){
      return _defenceMagic;
   }

   //============================================================
   // <T>设置魔法防御力的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setDefenceMagic(int value){
      _defenceMagic = value;
   }

   //============================================================
   // <T>判断行动值的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isMobilityChanged(){
      return __mobility != _mobility;
   }

   //============================================================
   // <T>获得行动值的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int mobility(){
      return _mobility;
   }

   //============================================================
   // <T>设置行动值的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setMobility(int value){
      _mobility = value;
   }

   //============================================================
   // <T>判断命中值的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isHitChanged(){
      return __hit != _hit;
   }

   //============================================================
   // <T>获得命中值的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int hit(){
      return _hit;
   }

   //============================================================
   // <T>设置命中值的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setHit(int value){
      _hit = value;
   }

   //============================================================
   // <T>判断闪避值的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isDodgeChanged(){
      return __dodge != _dodge;
   }

   //============================================================
   // <T>获得闪避值的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int dodge(){
      return _dodge;
   }

   //============================================================
   // <T>设置闪避值的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setDodge(int value){
      _dodge = value;
   }

   //============================================================
   // <T>判断暴击的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isCriticalChanged(){
      return __critical != _critical;
   }

   //============================================================
   // <T>获得暴击的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int critical(){
      return _critical;
   }

   //============================================================
   // <T>设置暴击的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setCritical(int value){
      _critical = value;
   }

   //============================================================
   // <T>判断标志的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isFlagsChanged(){
      return __flags != _flags;
   }

   //============================================================
   // <T>获得标志的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int flags(){
      return _flags;
   }

   //============================================================
   // <T>设置标志的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setFlags(int value){
      _flags = value;
   }

   //============================================================
   // <T>判断五行的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isWuxingChanged(){
      return __wuxing != _wuxing;
   }

   //============================================================
   // <T>获得五行的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int wuxing(){
      return _wuxing;
   }

   //============================================================
   // <T>设置五行的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setWuxing(int value){
      _wuxing = value;
   }

   //============================================================
   // <T>判断升级所需经验的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isExperienceupChanged(){
      return __experienceup != _experienceup;
   }

   //============================================================
   // <T>获得升级所需经验的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int experienceup(){
      return _experienceup;
   }

   //============================================================
   // <T>设置升级所需经验的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setExperienceup(int value){
      _experienceup = value;
   }

   //============================================================
   // <T>判断经验的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isExperienceChanged(){
      return __experience != _experience;
   }

   //============================================================
   // <T>获得经验的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int experience(){
      return _experience;
   }

   //============================================================
   // <T>设置经验的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setExperience(int value){
      _experience = value;
   }

   //============================================================
   // <T>判断初始等级的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isInitLevelChanged(){
      return __initLevel != _initLevel;
   }

   //============================================================
   // <T>获得初始等级的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int initLevel(){
      return _initLevel;
   }

   //============================================================
   // <T>设置初始等级的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setInitLevel(int value){
      _initLevel = value;
   }

   //============================================================
   // <T>判断初始体质的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isInitVitalityChanged(){
      return __initVitality != _initVitality;
   }

   //============================================================
   // <T>获得初始体质的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int initVitality(){
      return _initVitality;
   }

   //============================================================
   // <T>设置初始体质的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setInitVitality(int value){
      _initVitality = value;
   }

   //============================================================
   // <T>判断初始力量的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isInitStrengthChanged(){
      return __initStrength != _initStrength;
   }

   //============================================================
   // <T>获得初始力量的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int initStrength(){
      return _initStrength;
   }

   //============================================================
   // <T>设置初始力量的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setInitStrength(int value){
      _initStrength = value;
   }

   //============================================================
   // <T>判断初始耐力的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isInitStaminaChanged(){
      return __initStamina != _initStamina;
   }

   //============================================================
   // <T>获得初始耐力的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int initStamina(){
      return _initStamina;
   }

   //============================================================
   // <T>设置初始耐力的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setInitStamina(int value){
      _initStamina = value;
   }

   //============================================================
   // <T>判断初始魔力的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isInitMagicChanged(){
      return __initMagic != _initMagic;
   }

   //============================================================
   // <T>获得初始魔力的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int initMagic(){
      return _initMagic;
   }

   //============================================================
   // <T>设置初始魔力的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setInitMagic(int value){
      _initMagic = value;
   }

   //============================================================
   // <T>判断初始敏捷的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isInitAgilityChanged(){
      return __initAgility != _initAgility;
   }

   //============================================================
   // <T>获得初始敏捷的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int initAgility(){
      return _initAgility;
   }

   //============================================================
   // <T>设置初始敏捷的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setInitAgility(int value){
      _initAgility = value;
   }

   //============================================================
   // <T>判断物品包类型的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isItemBagCdChanged(){
      return __itemBagCd != _itemBagCd;
   }

   //============================================================
   // <T>获得物品包类型的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int itemBagCd(){
      return _itemBagCd;
   }

   //============================================================
   // <T>设置物品包类型的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setItemBagCd(int value){
      _itemBagCd = value;
   }

   //============================================================
   // <T>判断物品背包编号的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isItemBagIdChanged(){
      return __itemBagId != _itemBagId;
   }

   //============================================================
   // <T>获得物品背包编号的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public long itemBagId(){
      return _itemBagId;
   }

   //============================================================
   // <T>设置物品背包编号的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setItemBagId(long value){
      _itemBagId = value;
   }

   //============================================================
   // <T>判断物品包索引的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isItemBagIndexChanged(){
      return __itemBagIndex != _itemBagIndex;
   }

   //============================================================
   // <T>获得物品包索引的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int itemBagIndex(){
      return _itemBagIndex;
   }

   //============================================================
   // <T>设置物品包索引的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setItemBagIndex(int value){
      _itemBagIndex = value;
   }

   //============================================================
   // <T>判断物品快捷栏编号的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isItemBagShortcutIdChanged(){
      return __itemBagShortcutId != _itemBagShortcutId;
   }

   //============================================================
   // <T>获得物品快捷栏编号的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public long itemBagShortcutId(){
      return _itemBagShortcutId;
   }

   //============================================================
   // <T>设置物品快捷栏编号的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setItemBagShortcutId(long value){
      _itemBagShortcutId = value;
   }

   //============================================================
   // <T>判断物品快捷栏索引的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isItemBagShortcutIndexChanged(){
      return __itemBagShortcutIndex != _itemBagShortcutIndex;
   }

   //============================================================
   // <T>获得物品快捷栏索引的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int itemBagShortcutIndex(){
      return _itemBagShortcutIndex;
   }

   //============================================================
   // <T>设置物品快捷栏索引的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setItemBagShortcutIndex(int value){
      _itemBagShortcutIndex = value;
   }

   //============================================================
   // <T>判断出售开始时间的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isSellBeginDateChanged(){
      return !__sellBeginDate.equals(_sellBeginDate);
   }

   //============================================================
   // <T>获得出售开始时间的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public TDateTime sellBeginDate(){
      return _sellBeginDate;
   }

   //============================================================
   // <T>设置出售开始时间的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setSellBeginDate(TDateTime value){
      _sellBeginDate = value;
   }

   //============================================================
   // <T>判断拍卖时间的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isAuctionTimeCdChanged(){
      return __auctionTimeCd != _auctionTimeCd;
   }

   //============================================================
   // <T>获得拍卖时间的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int auctionTimeCd(){
      return _auctionTimeCd;
   }

   //============================================================
   // <T>设置拍卖时间的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setAuctionTimeCd(int value){
      _auctionTimeCd = value;
   }

   //============================================================
   // <T>判断金钱的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isCurrencyChanged(){
      return !RString.equals(__currency, _currency);
   }

   //============================================================
   // <T>获得金钱的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public String currency(){
      return _currency;
   }

   //============================================================
   // <T>设置金钱的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setCurrency(String value){
      _currency = value;
   }

   //============================================================
   // <T>判断获得时间的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isObtainTimeChanged(){
      return !__obtainTime.equals(_obtainTime);
   }

   //============================================================
   // <T>获得获得时间的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public TDateTime obtainTime(){
      return _obtainTime;
   }

   //============================================================
   // <T>设置获得时间的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setObtainTime(TDateTime value){
      _obtainTime = value;
   }

   //============================================================
   // <T>判断卡牌信息的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isCardListChanged(){
      return !RString.equals(__cardList, _cardList);
   }

   //============================================================
   // <T>获得卡牌信息的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public String cardList(){
      return _cardList;
   }

   //============================================================
   // <T>设置卡牌信息的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setCardList(String value){
      _cardList = value;
   }

   //============================================================
   // <T>判断交易状态的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isTradeStatusChanged(){
      return __tradeStatus != _tradeStatus;
   }

   //============================================================
   // <T>获得交易状态的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int tradeStatus(){
      return _tradeStatus;
   }

   //============================================================
   // <T>设置交易状态的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setTradeStatus(int value){
      _tradeStatus = value;
   }

   //============================================================
   // <T>判断创建用户标识的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isCreateUserIdChanged(){
      return __createUserId != _createUserId;
   }

   //============================================================
   // <T>获得创建用户标识的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int createUserId(){
      return _createUserId;
   }

   //============================================================
   // <T>设置创建用户标识的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setCreateUserId(int value){
      _createUserId = value;
   }

   //============================================================
   // <T>判断创建日期的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isCreateDateChanged(){
      return !__createDate.equals(_createDate);
   }

   //============================================================
   // <T>获得创建日期的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public TDateTime createDate(){
      return _createDate;
   }

   //============================================================
   // <T>设置创建日期的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setCreateDate(TDateTime value){
      _createDate = value;
   }

   //============================================================
   // <T>判断更新者标识的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isUpdateUserIdChanged(){
      return __updateUserId != _updateUserId;
   }

   //============================================================
   // <T>获得更新者标识的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public int updateUserId(){
      return _updateUserId;
   }

   //============================================================
   // <T>设置更新者标识的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setUpdateUserId(int value){
      _updateUserId = value;
   }

   //============================================================
   // <T>判断更新时间的数据是否改变。</T>
   //
   // @return 数据内容
   //============================================================
   public boolean isUpdateDateChanged(){
      return !__updateDate.equals(_updateDate);
   }

   //============================================================
   // <T>获得更新时间的数据内容。</T>
   //
   // @return 数据内容
   //============================================================
   public TDateTime updateDate(){
      return _updateDate;
   }

   //============================================================
   // <T>设置更新时间的数据内容。</T>
   //
   // @param value 数据内容
   //============================================================
   public void setUpdateDate(TDateTime value){
      _updateDate = value;
   }

   //============================================================
   // <T>加载行记录。</T>
   //
   // @param row 行记录
   //============================================================
   public void load(FRow row){
      __ouid = RLong.parse(row.get("ouid"));
      _ouid = __ouid;
      __uniqueId = row.getInteger("unique_id");
      _uniqueId = __uniqueId;
      __roleId = RLong.parse(row.get("role_id"));
      _roleId = __roleId;
      __petTid = row.getInteger("pet_tid");
      _petTid = __petTid;
      __label = row.get("label");
      _label = __label;
      __petRaceTid = row.getInteger("pet_race_tid");
      _petRaceTid = __petRaceTid;
      __petTypeTid = row.getInteger("pet_type_tid");
      _petTypeTid = __petTypeTid;
      __petStyleTid = row.getInteger("pet_style_tid");
      _petStyleTid = __petStyleTid;
      __level = row.getInteger("level");
      _level = __level;
      __life = row.getInteger("life");
      _life = __life;
      __understanding = row.getInteger("understanding");
      _understanding = __understanding;
      __speed = row.getInteger("speed");
      _speed = __speed;
      __vitality = row.getInteger("vitality");
      _vitality = __vitality;
      __strength = row.getInteger("strength");
      _strength = __strength;
      __stamina = row.getInteger("stamina");
      _stamina = __stamina;
      __magic = row.getInteger("magic");
      _magic = __magic;
      __agility = row.getInteger("agility");
      _agility = __agility;
      __mp = row.get("mp");
      _mp = __mp;
      __hp = row.get("hp");
      _hp = __hp;
      __itgHp = row.getInteger("itg_hp");
      _itgHp = __itgHp;
      __itgAttackPhysical = row.getInteger("itg_attack_physical");
      _itgAttackPhysical = __itgAttackPhysical;
      __itgDefencePhysical = row.getInteger("itg_defence_physical");
      _itgDefencePhysical = __itgDefencePhysical;
      __itgAttackMag = row.getInteger("itg_attack_mag");
      _itgAttackMag = __itgAttackMag;
      __itgDefenMag = row.getInteger("itg_defen_mag");
      _itgDefenMag = __itgDefenMag;
      __itgMobility = row.getInteger("itg_mobility");
      _itgMobility = __itgMobility;
      __itgGrow = row.getInteger("itg_grow");
      _itgGrow = __itgGrow;
      __potencyPoint = row.getInteger("potency_point");
      _potencyPoint = __potencyPoint;
      __itemPotencyPointTiems = row.getInteger("item_potency_point_tiems");
      _itemPotencyPointTiems = __itemPotencyPointTiems;
      __attackPhysical = row.getInteger("attack_physical");
      _attackPhysical = __attackPhysical;
      __attackMagic = row.getInteger("attack_magic");
      _attackMagic = __attackMagic;
      __defencePhysical = row.getInteger("defence_physical");
      _defencePhysical = __defencePhysical;
      __defenceMagic = row.getInteger("defence_magic");
      _defenceMagic = __defenceMagic;
      __mobility = row.getInteger("mobility");
      _mobility = __mobility;
      __hit = row.getInteger("hit");
      _hit = __hit;
      __dodge = row.getInteger("dodge");
      _dodge = __dodge;
      __critical = row.getInteger("critical");
      _critical = __critical;
      __flags = row.getInteger("flags");
      _flags = __flags;
      __wuxing = row.getInteger("wuxing");
      _wuxing = __wuxing;
      __experienceup = row.getInteger("experienceup");
      _experienceup = __experienceup;
      __experience = row.getInteger("experience");
      _experience = __experience;
      __initLevel = row.getInteger("init_level");
      _initLevel = __initLevel;
      __initVitality = row.getInteger("init_vitality");
      _initVitality = __initVitality;
      __initStrength = row.getInteger("init_strength");
      _initStrength = __initStrength;
      __initStamina = row.getInteger("init_stamina");
      _initStamina = __initStamina;
      __initMagic = row.getInteger("init_magic");
      _initMagic = __initMagic;
      __initAgility = row.getInteger("init_agility");
      _initAgility = __initAgility;
      __itemBagCd = row.getInteger("item_bag_cd");
      _itemBagCd = __itemBagCd;
      __itemBagId = RLong.parse(row.get("item_bag_id"));
      _itemBagId = __itemBagId;
      __itemBagIndex = row.getInteger("item_bag_index");
      _itemBagIndex = __itemBagIndex;
      __itemBagShortcutId = RLong.parse(row.get("item_bag_shortcut_id"));
      _itemBagShortcutId = __itemBagShortcutId;
      __itemBagShortcutIndex = row.getInteger("item_bag_shortcut_index");
      _itemBagShortcutIndex = __itemBagShortcutIndex;
      __sellBeginDate.parse(row.get("sell_begin_date"));
      _sellBeginDate.assign(__sellBeginDate);
      __auctionTimeCd = row.getInteger("auction_time_cd");
      _auctionTimeCd = __auctionTimeCd;
      __currency = row.get("currency");
      _currency = __currency;
      __obtainTime.parse(row.get("obtain_time"));
      _obtainTime.assign(__obtainTime);
      __cardList = row.get("card_list");
      _cardList = __cardList;
      __tradeStatus = row.getInteger("trade_status");
      _tradeStatus = __tradeStatus;
      __createUserId = row.getInteger("create_user_id");
      _createUserId = __createUserId;
      __createDate.parse(row.get("create_date"));
      _createDate.assign(__createDate);
      __updateUserId = row.getInteger("update_user_id");
      _updateUserId = __updateUserId;
      __updateDate.parse(row.get("update_date"));
      _updateDate.assign(__updateDate);
   }
}