package org.mo.web.core.webtheme.common;

//============================================================
// <T>过滤器对象的XML节点基类。</T>
//============================================================
public interface XFilterFace
      extends
         XObjectFace
{
   // 名称定义
   String NAME = "IFilter";

   // 激活过滤器的名称定义
   String PTY_ENABLE = "enable";

   //============================================================
   // <T>获得激活过滤器的内容。</T>
   //
   // @return 激活过滤器
   //============================================================
   String getEnable();

   //============================================================
   // <T>设置激活过滤器的内容。</T>
   //
   // @param value 激活过滤器
   //============================================================
   void setEnable(String value);
}
