package org.mo.com.io;

import org.mo.com.io.base.MCharStream;

//============================================================
//<T>字符数据流。</T>
//============================================================
public class FCharStream
      extends MCharStream
{
   //============================================================
   // <T>构造字符数据流。</T>
   //============================================================
   public FCharStream(){
   }

   //============================================================
   // <T>构造字符数据流。</T>
   //
   // @param capacity 容量
   //============================================================
   public FCharStream(int capacity){
      super(capacity);
   }
}
