package org.mo.com.io;

import org.mo.com.io.base.MFloatStream;

//============================================================
//<T>浮点数数据流。</T>
//============================================================
public class FFloatStream
      extends MFloatStream
{
   //============================================================
   // <T>构造浮点数数据流。</T>
   //============================================================
   public FFloatStream(){
   }

   //============================================================
   // <T>构造浮点数数据流。</T>
   //
   // @param capacity 容量
   //============================================================
   public FFloatStream(int capacity){
      super(capacity);
   }
}
