package org.mo.com.io;

import org.mo.com.io.base.MShortStream;

//============================================================
// <T>短整数数据流。</T>
//============================================================
public class FShortStream
      extends MShortStream
{
   //============================================================
   // <T>构造短整数数据流。</T>
   //============================================================
   public FShortStream(){
   }

   //============================================================
   // <T>构造短整数数据流。</T>
   //
   // @param capacity 容量
   //============================================================
   public FShortStream(int capacity){
      super(capacity);
   }
}
