package org.mo.com.io;

//============================================================
// <T>输出流接口。</T>
//============================================================
public interface IOutput
{
   //============================================================
   // <T>写入字节数组。</T>
   //
   // @param data 字节集合
   // @param offset 位置
   // @param length 长度
   // @return 写入长度
   //============================================================
   int write(byte[] data,
             int offset,
             int length);
}
