using System.Collections.Generic;
using System.Drawing;

/// ************************************************************
/// <summary>真彩色到256索引色颜色降色处理。</summary>
/// <summary>
///    代码参考：http://www.codeproject.com/KB/recipes/SimplePaletteQuantizer.aspx
/// </summary>
/// ************************************************************

namespace MO.Core.Content.Picture.Quantizers
{
   /// ============================================================
   /// <summary>颜色优化器接口。</summary>
   /// ============================================================
   public interface IColorQuantizer
   {
      /// ============================================================
      /// <summary>增加一个新颜色。</summary>
      /// <param name="color">颜色</param>
      /// ============================================================
      void AddColor(Color color);

      /// ============================================================
      /// <summary>获得颜色总数。</summary>
      /// <returns>颜色总数</returns>
      /// ============================================================
      int GetColorCount();

      /// ============================================================
      /// <summary>生成指定颜色数目的调色板。</summary>
      /// <param name="count">颜色数目</param>
      /// <returns>颜色列表</returns>
      /// ============================================================
      List<Color> MakePalette(int count);

      /// ============================================================
      /// <summary>找到指定颜色在调色板内的索引位置。</summary>
      /// <param name="color">颜色</param>
      /// <returns>索引位置</returns>
      /// ============================================================
      int FindPaletteIndex(Color color);

      /// ============================================================
      /// <summary>清除所有内容。</summary>
      /// ============================================================
      void Clear();
   }
}