package org.mo.web.core.webtree.common;

import org.mo.com.xml.IXmlObject;

//============================================================
// <T>样式控件对象的XML节点基类。</T>
//============================================================
public interface XStyleFace
      extends IXmlObject
{
   // 名称定义
   String NAME = "IStyle";

   // 字体颜色的名称定义
   String PTY_COLOR = "color";

   // 背景颜色的名称定义
   String PTY_BG_COLOR = "bg_color";

   //============================================================
   // <T>获得字体颜色的内容。</T>
   //
   // @return 字体颜色
   //============================================================
   String getColor();

   //============================================================
   // <T>设置字体颜色的内容。</T>
   //
   // @param value 字体颜色
   //============================================================
   void setColor(String value);

   //============================================================
   // <T>获得背景颜色的内容。</T>
   //
   // @return 背景颜色
   //============================================================
   String getBgColor();

   //============================================================
   // <T>设置背景颜色的内容。</T>
   //
   // @param value 背景颜色
   //============================================================
   void setBgColor(String value);
}