package org.mo.eng.data;

import org.mo.com.data.ISqlConnection;
import org.mo.com.lang.FDictionary;

//============================================================
// <T>数据库链接管理类。</T>
//
// @return 链接控制台集合
//============================================================
public interface IDatabaseConsole
{ //============================================================
  // <T>获得链接控制台集合。</T>
  //
  // @return 链接控制台集合
  //============================================================
   FDictionary<IConnectionConsole> consoles();

   //============================================================
   // <T>获得链接控制台集合。</T>
   //
   // @return 链接控制台集合
   //============================================================
   IConnectionConsole[] connectionConsoles();

   //============================================================
   // <T>根据名称获得一个链接控制台。</T>
   //
   // @param name 数据库名称
   // @return 链接控制台
   //============================================================ 
   IConnectionConsole connectionConsole(String name);

   //============================================================
   // <T>增加一个链接控制台。</T>
   //
   // @param connectionConsole 链接控制台
   //============================================================ 
   void add(IConnectionConsole connectionConsole);

   //============================================================
   // <T>收集一个未使用的数据库链接。</T>
   //
   // @return 数据库链接
   //============================================================ 
   ISqlConnection alloc();

   //============================================================
   // <T>收集一个未使用的数据库链接。</T>
   //
   // @param name 数据库名称
   // @return 数据库链接
   //============================================================ 
   ISqlConnection alloc(String name);

   //============================================================
   // <T>回收一个未使用的数据库链接。</T>
   //
   // @param connection 数据库链接
   //============================================================ 
   void free(ISqlConnection connection);

   //============================================================
   // <T>释放一个未使用的数据库链接。</T>
   //
   // @param connection 数据库链接
   //============================================================ 
   void releaseConnection(ISqlConnection connection);

   //============================================================
   // <T>释放一个指定名称的链接控制台。</T>
   //
   // @param name 链接控制台名称
   //============================================================ 
   void release(String databaseName);

   //============================================================
   // <T>释放一个全部的链接控制台名称。</T>
   //============================================================ 
   void releaseAll();
}
