#include "MoEgEntity.h"

MO_NAMESPACE_BEGIN

//============================================================
// <T>构造实体。</T>
//============================================================
FEntity::FEntity(){
   _typeCd = EEntityType_Unknown;
   MO_CLEAR(_pLayer);
}

//============================================================
// <T>析构实体。</T>
//============================================================
FEntity::~FEntity(){
}

//============================================================
// <T>配置处理。</T>
//
// @return 处理结果
//============================================================
TResult FEntity::Setup(){
   return ESuccess;
}

//============================================================
// <T>移动到指定坐标。</T>
//
// @param x 横坐标
// @param y 纵坐标
// @return 处理结果
//============================================================
TResult FEntity::MoveTo(TFloat x, TFloat y){
   _space.location.Set(x, y);
   return ESuccess;
}

//============================================================
// <T>过滤绘制对象集合。</T>
//
// @param pDrawables 绘制对象
// @return 处理结果
//============================================================
TResult FEntity::FilterDrawable(FDrawableCollection* pDrawables){
   return ESuccess;
}

//============================================================
// <T>更新处理。</T>
//
// @return 处理结果
//============================================================
TResult FEntity::Update(){
   return ESuccess;
}

//============================================================
// <T>逻辑处理。</T>
//
// @return 处理结果
//============================================================
TResult FEntity::Process(){
   return ESuccess;
}

//============================================================
// <T>释放处理。</T>
//
// @return 处理结果
//============================================================
TResult FEntity::Dispose(){
   return ESuccess;
}

MO_NAMESPACE_END
