#include "MoEgNet.h"

MO_NAMESPACE_BEGIN

//============================================================
// <T>构造网络控制台。</T>
//============================================================
FNetReceiveThread::FNetReceiveThread(){

}

//============================================================
// <T>构造网络控制台。</T>
//============================================================
FNetReceiveThread::~FNetReceiveThread(){

}

//============================================================
// <T>构造网络控制台。</T>
//============================================================
TResult FNetReceiveThread::Process(){
   return ESuccess;
}

MO_NAMESPACE_END
