namespace MO.Common.IO
{
   //============================================================
   // <T>输出流。</T>
   //
   // @history MAOCY 140414
   //============================================================
   public interface IOutput
   {
      //============================================================
      // <T>写入一段数据。</T>
      //
      // @params bytes 字节流
      // @params offset 偏移量
      // @params length 写入长度
      //============================================================
      int Write(byte[] bytes, int offset, int length);
   }
}
