namespace MS.Common.IO
{
   //============================================================
   // <T>输入流。</T>
   //
   // @history MAOCY 140414
   //============================================================
   public interface IInput
   {
      //============================================================
      // <T>读取一段数据。</T>
      //
      // @params bytes 目标字节流
      // @params offset 目标字节流的写入位置
      // @params length 读取的长度
      //============================================================
      int Read(byte[] bytes, int offset, int length);
   }
}
