package org.mo.jfa.face.apl.form;

import org.mo.com.lang.FObjectId;

//============================================================
// <T>表单容器。</T>
//============================================================
public class FFormContainer
      extends FObjectId
{
   // 表单名称
   protected String _form;

   // 命令
   protected String _action;

   // 数据名称
   protected String _database;

   // 表单分页
   protected String _page;

   // 打包数据
   protected String _pack;

   // 表单内容
   protected String _html;

   //============================================================
   // <T>获得表单名称。</T>
   //
   // @return 表单名称
   //============================================================
   public String form(){
      return _form;
   }

   //============================================================
   // <T>设置表单名称。</T>
   //
   // @param form 表单名称
   //============================================================
   public void setForm(String form){
      _form = form;
   }

   //============================================================
   // <T>获得命令。</T>
   //
   // @return 命令
   //============================================================
   public String action(){
      return _action;
   }

   //============================================================
   // <T>设置命令。</T>
   //
   // @param action 命令
   //============================================================
   public void setAction(String action){
      _action = action;
   }

   //============================================================
   // <T>获得数据名称。</T>
   //
   // @return 数据名称
   //============================================================
   public String database(){
      return _database;
   }

   //============================================================
   // <T>设置数据名称。</T>
   //
   // @param database 数据名称
   //============================================================
   public void setDatabase(String database){
      _database = database;
   }

   //============================================================
   // <T>获得表单分页。</T>
   //
   // @return 表单分页
   //============================================================
   public String page(){
      return _page;
   }

   //============================================================
   // <T>设置表单分页。</T>
   //
   // @param page 表单分页
   //============================================================
   public void setPage(String page){
      _page = page;
   }

   //============================================================
   // <T>获得打包数据。</T>
   //
   // @return 打包数据
   //============================================================
   public String pack(){
      return _pack;
   }

   //============================================================
   // <T>设置打包数据。</T>
   //
   // @param pack 打包数据
   //============================================================
   public void setPack(String pack){
      _pack = pack;
   }

   //============================================================
   // <T>获得表单内容。</T>
   //
   // @return 表单内容
   //============================================================
   public String html(){
      return _html;
   }

   //============================================================
   // <T>设置表单内容。</T>
   //
   // @param html 表单内容
   //============================================================
   public void setHtml(String html){
      _html = html;
   }
}
