package org.mo.data.chart.common;

import org.mo.com.xml.IXmlObject;

//============================================================
// <T>图表边距接口对象的XML节点基类。</T>
//============================================================
public interface XMarginFace
      extends IXmlObject
{
   // 名称定义
   String NAME = "IMargin";

   // 左边距的名称定义
   String PTY_MARGIN_LEFT = "margin_left";

   // 右边距的名称定义
   String PTY_MARGIN_RIGHT = "margin_right";

   // 上边距的名称定义
   String PTY_MARGIN_TOP = "margin_top";

   // 底边距的名称定义
   String PTY_MARGIN_BOTTOM = "margin_bottom";

   //============================================================
   // <T>获得左边距的内容。</T>
   //
   // @return 左边距
   //============================================================
   String getMarginLeft();

   //============================================================
   // <T>设置左边距的内容。</T>
   //
   // @param value 左边距
   //============================================================
   void setMarginLeft(String value);

   //============================================================
   // <T>获得右边距的内容。</T>
   //
   // @return 右边距
   //============================================================
   String getMarginRight();

   //============================================================
   // <T>设置右边距的内容。</T>
   //
   // @param value 右边距
   //============================================================
   void setMarginRight(String value);

   //============================================================
   // <T>获得上边距的内容。</T>
   //
   // @return 上边距
   //============================================================
   String getMarginTop();

   //============================================================
   // <T>设置上边距的内容。</T>
   //
   // @param value 上边距
   //============================================================
   void setMarginTop(String value);

   //============================================================
   // <T>获得底边距的内容。</T>
   //
   // @return 底边距
   //============================================================
   String getMarginBottom();

   //============================================================
   // <T>设置底边距的内容。</T>
   //
   // @param value 底边距
   //============================================================
   void setMarginBottom(String value);
}