using Microsoft.Win32;
using MO.Common.Lang;

namespace MO.Core.Content.Register
{
   //============================================================
   // <T>注册表操作对象。</T>
   //============================================================
   public class FRegister
   {
      // 定义节点
      protected RegistryKey _key;

      //============================================================
      // <T>定义无参构造。</T>
      //============================================================
      public FRegister() {         
      }

      //============================================================
      // <T>根据名称读取当前节点的值。</T>
      //
      // @param keyName 键内容
      //============================================================
      public RegistryKey Key {
         get { return _key; }
         set { _key = value; }
      }

      //============================================================
      // <T>读取对象的名称。</T>            
      //============================================================
      public string KeyName {
         get { return _key.Name; }
      }

      //============================================================
      // <T>读取对象的值。</T>
      //============================================================
      public object Value {
         get { return _key.GetValue(KeyName); }
      }
   }
}
