package org.mo.data.dataset.common;

//============================================================
// <T>数据对象对象的XML节点基类。</T>
//============================================================
public interface XFieldFace
      extends
         XObjectFace,
         XAccessFace
{
   // 名称定义
   String NAME = "IField";

   // 主键的名称定义
   String PTY_IS_KEY = "is_key";

   // 空值的名称定义
   String PTY_IS_NULL = "is_null";

   // 唯一值的名称定义
   String PTY_IS_UNIQUE = "is_unique";

   // 可存储的名称定义
   String PTY_IS_STORE = "is_store";

   // 虚字段的名称定义
   String PTY_IS_ABSTRACT = "is_abstract";

   // 可加密的名称定义
   String PTY_IS_ENCRYPT = "is_encrypt";

   // 数据名称的名称定义
   String PTY_DATA_NAME = "data_name";

   // 数据格式的名称定义
   String PTY_DATA_FORMAT = "data_format";

   // 数据别称的名称定义
   String PTY_DATA_ALIAS = "data_alias";

   // 数据类型的名称定义
   String PTY_DATA_TYPE = "data_type";

   // 数据大小的名称定义
   String PTY_DATA_SIZE = "data_size";

   // 数据引用的名称定义
   String PTY_DATA_REFER = "data_refer";

   // 数据编号的名称定义
   String PTY_DATA_CODE = "data_code";

   // 唯一名称集的名称定义
   String PTY_DATA_UNIQUES = "data_uniques";

   // 分组类型的名称定义
   String PTY_GROUP = "group";

   // 新建缺省的名称定义
   String PTY_DATA_DEFAULT = "data_default";

   // 新建数据的名称定义
   String PTY_DATA_INSERT = "data_insert";

   // 更新数据的名称定义
   String PTY_DATA_UPDATE = "data_update";

   // 索引名称的名称定义
   String PTY_INDEX_NAMES = "index_names";

   //============================================================
   // <T>获得主键的内容。</T>
   //
   // @return 主键
   //============================================================
   Boolean getIsKey();

   //============================================================
   // <T>设置主键的内容。</T>
   //
   // @param value 主键
   //============================================================
   void setIsKey(Boolean value);

   //============================================================
   // <T>获得空值的内容。</T>
   //
   // @return 空值
   //============================================================
   Boolean getIsNull();

   //============================================================
   // <T>设置空值的内容。</T>
   //
   // @param value 空值
   //============================================================
   void setIsNull(Boolean value);

   //============================================================
   // <T>获得唯一值的内容。</T>
   //
   // @return 唯一值
   //============================================================
   Boolean getIsUnique();

   //============================================================
   // <T>设置唯一值的内容。</T>
   //
   // @param value 唯一值
   //============================================================
   void setIsUnique(Boolean value);

   //============================================================
   // <T>获得可存储的内容。</T>
   //
   // @return 可存储
   //============================================================
   String getIsStore();

   //============================================================
   // <T>设置可存储的内容。</T>
   //
   // @param value 可存储
   //============================================================
   void setIsStore(String value);

   //============================================================
   // <T>获得虚字段的内容。</T>
   //
   // @return 虚字段
   //============================================================
   String getIsAbstract();

   //============================================================
   // <T>设置虚字段的内容。</T>
   //
   // @param value 虚字段
   //============================================================
   void setIsAbstract(String value);

   //============================================================
   // <T>获得可加密的内容。</T>
   //
   // @return 可加密
   //============================================================
   String getIsEncrypt();

   //============================================================
   // <T>设置可加密的内容。</T>
   //
   // @param value 可加密
   //============================================================
   void setIsEncrypt(String value);

   //============================================================
   // <T>获得数据名称的内容。</T>
   //
   // @return 数据名称
   //============================================================
   String getDataName();

   //============================================================
   // <T>设置数据名称的内容。</T>
   //
   // @param value 数据名称
   //============================================================
   void setDataName(String value);

   //============================================================
   // <T>获得数据格式的内容。</T>
   //
   // @return 数据格式
   //============================================================
   String getDataFormat();

   //============================================================
   // <T>设置数据格式的内容。</T>
   //
   // @param value 数据格式
   //============================================================
   void setDataFormat(String value);

   //============================================================
   // <T>获得数据别称的内容。</T>
   //
   // @return 数据别称
   //============================================================
   String getDataAlias();

   //============================================================
   // <T>设置数据别称的内容。</T>
   //
   // @param value 数据别称
   //============================================================
   void setDataAlias(String value);

   //============================================================
   // <T>获得数据类型的内容。</T>
   //
   // @return 数据类型
   //============================================================
   String getDataType();

   //============================================================
   // <T>设置数据类型的内容。</T>
   //
   // @param value 数据类型
   //============================================================
   void setDataType(String value);

   //============================================================
   // <T>获得数据大小的内容。</T>
   //
   // @return 数据大小
   //============================================================
   String getDataSize();

   //============================================================
   // <T>设置数据大小的内容。</T>
   //
   // @param value 数据大小
   //============================================================
   void setDataSize(String value);

   //============================================================
   // <T>获得数据引用的内容。</T>
   //
   // @return 数据引用
   //============================================================
   String getDataRefer();

   //============================================================
   // <T>设置数据引用的内容。</T>
   //
   // @param value 数据引用
   //============================================================
   void setDataRefer(String value);

   //============================================================
   // <T>获得数据编号的内容。</T>
   //
   // @return 数据编号
   //============================================================
   String getDataCode();

   //============================================================
   // <T>设置数据编号的内容。</T>
   //
   // @param value 数据编号
   //============================================================
   void setDataCode(String value);

   //============================================================
   // <T>获得唯一名称集的内容。</T>
   //
   // @return 唯一名称集
   //============================================================
   String getDataUniques();

   //============================================================
   // <T>设置唯一名称集的内容。</T>
   //
   // @param value 唯一名称集
   //============================================================
   void setDataUniques(String value);

   //============================================================
   // <T>获得分组类型的内容。</T>
   //
   // @return 分组类型
   //============================================================
   String getGroup();

   //============================================================
   // <T>设置分组类型的内容。</T>
   //
   // @param value 分组类型
   //============================================================
   void setGroup(String value);

   //============================================================
   // <T>获得新建缺省的内容。</T>
   //
   // @return 新建缺省
   //============================================================
   String getDataDefault();

   //============================================================
   // <T>设置新建缺省的内容。</T>
   //
   // @param value 新建缺省
   //============================================================
   void setDataDefault(String value);

   //============================================================
   // <T>获得新建数据的内容。</T>
   //
   // @return 新建数据
   //============================================================
   String getDataInsert();

   //============================================================
   // <T>设置新建数据的内容。</T>
   //
   // @param value 新建数据
   //============================================================
   void setDataInsert(String value);

   //============================================================
   // <T>获得更新数据的内容。</T>
   //
   // @return 更新数据
   //============================================================
   String getDataUpdate();

   //============================================================
   // <T>设置更新数据的内容。</T>
   //
   // @param value 更新数据
   //============================================================
   void setDataUpdate(String value);

   //============================================================
   // <T>获得索引名称的内容。</T>
   //
   // @return 索引名称
   //============================================================
   String getIndexNames();

   //============================================================
   // <T>设置索引名称的内容。</T>
   //
   // @param value 索引名称
   //============================================================
   void setIndexNames(String value);
}
