package org.mo.script.as.parser;

//============================================================
// <T>包对象。</T>
//============================================================
public class FAsPackage
      extends FAsObject
{
   // 类集合
   protected FAsClasses _classes = new FAsClasses();

   //============================================================
   // <T>构造包对象。</T>
   //============================================================
   public FAsPackage(){
   }

   //============================================================
   // <T>获得类集合。</T>
   //
   // @return 类集合
   //============================================================
   public FAsClasses classes(){
      return _classes;
   }

   //============================================================
   // <T>增加类对象。</T>
   //
   // @param asClass 类对象
   //============================================================
   public void push(FAsClass asClass){
      _classes.set(asClass.name(), asClass);
   }
}
