namespace MO.Common.Content
{
   //============================================================
   // <T>对象文档接口。</T>
   //============================================================
   public interface IXmlObjectDocument
   {
      //============================================================
      // <T>加载对象文件。</T>
      //
      // @param top 顶层对象
      // @param filename 文件名称
      //============================================================
      void LoadFile(IXmlObject top, string filename);
   }
}
