package org.mo.com.lang;

import org.mo.com.lang.generic.MAttributes;

//============================================================
// <T>属性表。</T>
//============================================================
@SuppressWarnings("unchecked")
public class FAttributes
      extends MAttributes
{
   //============================================================
   // <T>构造属性表。</T>
   //============================================================
   public FAttributes(){
   }

   //============================================================
   // <T>构造属性表。</T>
   //
   // @param capacity 容量
   //============================================================
   public FAttributes(int capacity){
      super(capacity);
   }

   //============================================================
   // <T>构造属性表。</T>
   //
   // @param pack 打包字符串
   //============================================================
   public FAttributes(String pack){
      unpack(pack);
   }

   //============================================================
   // <T>构造属性表。</T>
   //
   // @param attributes 属性表
   //============================================================
   public FAttributes(IAttributes attributes){
      append(attributes);
   }
}
