package org.mo.com.lang;

import org.mo.com.lang.generic.MBooleans;

//============================================================
// <T>布尔类型集合。</T>
//============================================================
public class FBooleans
      extends MBooleans
{
   //============================================================
   // <T>构造布尔类型集合。</T>
   //============================================================
   public FBooleans(){
   }

   //============================================================
   // <T>构造布尔类型集合。</T>
   //
   // @param capacity 容量
   //============================================================
   public FBooleans(int capacity){
      super(capacity);
   }

   //============================================================
   // <T>构造布尔类型集合。</T>
   //
   // @param data 数据集合
   //============================================================
   public FBooleans(boolean[] data){
      append(data);
   }
}
