package org.mo.com.lang;

import org.mo.com.lang.generic.TDumpInfo;

//============================================================
// <T>基础对象。</T>
//============================================================
public class FObject
      implements
         IDump
{
   //============================================================
   //<T>构造基础对象。</T>
   //============================================================
   public FObject(){
   }

   //============================================================
   // <T>获得字符串内容。</T>
   //
   // @return 字符串内容
   //============================================================
   @Override
   public String toString(){
      return getClass().getSimpleName() + "@" + RHex.toString(hashCode(), 8);
   }

   //============================================================
   // <T>获得运行信息。</T>
   //
   // @return 运行信息
   //============================================================
   @Override
   public String dump(){
      TDumpInfo info = new TDumpInfo(this);
      return dump(info).toString();
   }

   //============================================================
   // <T>生成运行信息。</T>
   //
   // @param info 运行信息
   // @return 运行信息
   //============================================================
   @Override
   public TDumpInfo dump(TDumpInfo info){
      return info;
   }
}
