package org.mo.com.lang;

import org.mo.com.lang.generic.MStringPairs;

//============================================================
// <T>字符串值对集合。</T>
//============================================================
public class FStringPairs
      extends MStringPairs
{
   //============================================================
   // <T>构造字符串值对集合。</T>
   //============================================================
   public FStringPairs(){
   }

   //============================================================
   // <T>构造字符串值对集合。</T>
   //
   // @param capacity 容量
   //============================================================
   public FStringPairs(int capacity){
      super(capacity);
   }
}
