package org.mo.com.lang;

import org.mo.com.lang.generic.MString;

//============================================================
// <T>字符串。</T>
//============================================================
public class FString
      extends MString
{
   //============================================================
   // <T>构造字符串。</T>
   //============================================================
   public FString(){
   }

   //============================================================
   // <T>构造字符串。</T>
   //
   // @param capacity 初始容量
   //============================================================
   public FString(int capacity){
      super(capacity);
   }

   //============================================================
   // <T>构造字符串。</T>
   //
   // @param data 字节数组
   // @param charset 编码
   //============================================================
   public FString(byte[] data,
                  String charset){
      append(data, charset);
   }

   //============================================================
   // <T>构造字符串。</T>
   //
   // @param data 字符数组
   //============================================================
   public FString(char[] data){
      append(data, 0, data.length);
   }

   //============================================================
   // <T>构造字符串。</T>
   //
   // @param data 字符数组
   // @param offset 开始位置
   // @param length 数据长度
   //============================================================
   public FString(char[] chars,
                  int offset,
                  int length){
      append(chars, offset, length);
   }

   //============================================================
   // <T>构造字符串。</T>
   //
   // @param value 字符串
   //============================================================
   public FString(String value){
      assign(value);
   }
}
