package org.mo.com.lang;

//============================================================
// <T>校验例外。</T>
//============================================================
public class FValidError
      extends FError
{
   // 序列化标识
   private final static long serialVersionUID = 1L;

   //============================================================
   // <T>构造校验例外。</T>
   //============================================================
   public FValidError(){
   }

   //============================================================
   // <T>构造校验例外。</T>
   //
   // @param message 消息
   //============================================================
   public FValidError(String message){
      super(message);
   }

   //============================================================
   // <T>构造校验例外。</T>
   //
   // @param message 消息
   // @param params 参数
   //============================================================
   public FValidError(String message,
                      Object... params){
      super(message, params);
   }
}
