package org.mo.com.lang;

//============================================================
// <T>属性表接口。</T>
//============================================================
public interface IAttributes
      extends
         IDictionary<String>,
         Iterable<IStringPair>
{
   //============================================================
   // <T>分割字符串为属性集合。</T>
   //
   // @param value 字符串
   //============================================================
   void split(String value);

   //============================================================
   // <T>分割字符串为属性集合。</T>
   //
   // @param value 字符串
   // @param splitValue 内容分割符
   //============================================================
   void split(String value,
              String splitValue);

   //============================================================
   // <T>分割字符串为属性集合。</T>
   //
   // @param value 字符串
   // @param splitName 名称分割符
   // @param splitValue 内容分割符
   //============================================================
   void split(String value,
              String splitName,
              String splitValue);

   //============================================================
   // <T>分割字符串为属性集合。</T>
   //
   // @param value 字符串
   // @param splitName 名称分割符
   // @param splitValue 内容分割符
   // @param merge 是否合并
   //============================================================
   void split(String value,
              char splitName,
              char splitValue,
              boolean merge);

   //============================================================
   // <T>分割信息字符串成为集合。</T>
   //
   // @param source 字符串
   // @param splitName 名称分割字符串
   // @param splitValue 内容分割字符串
   // @param merge 是否合并
   //============================================================
   void split(String source,
              String splitName,
              String splitValue,
              boolean merge);

   //============================================================
   // <T>生成打包字符串。</T>
   //
   // @return 打包字符串
   //============================================================
   String pack();

   //============================================================
   // <T>解包字符串。</T>
   //
   // @param pack 打包字符串
   //============================================================
   void unpack(String pack);

   //============================================================
   // <T>解包字符串。</T>
   //
   // @param pack 打包字符串
   // @param merge 合并内容
   //============================================================
   void unpack(String pack,
               boolean merge);
}
