package org.mo.com.lang;

//============================================================
// <T>显示格式化接口。</T>
//============================================================
public interface IDisplayFormator
{
   //============================================================
   // <T>格式化内容字符串为显示字符串。</T>
   //
   // @param value 内容字符串
   // @return 显示字符串
   //============================================================
   String formatDisplay(String value);

   //============================================================
   // <T>格式化显示字符串为内容字符串。</T>
   //
   // @param text 显示字符串
   // @return 内容字符串
   //============================================================
   String formatValue(String text);
}
