package org.mo.com.lang;

//============================================================
// <T>打包接口。</T>
//============================================================
public interface IPack
{
   // 普通方式
   int NORMAL = 0;

   char NORMAL_CHR = 'N';

   String NORMAL_STR = "N";

   // Base64方式
   int BASE64 = 1;

   char BASE64_CHR = 'B';

   String BASE64_STR = "B";

   //============================================================
   // <T>获得打包字符串。</T>
   //
   // @return 打包字符串
   //============================================================
   String pack();

   //============================================================
   // <T>解包处理。</T>
   //
   // @param pack 打包字符串
   //============================================================
   void unpack(String pack);
}
