package org.mo.web.core.webtools.common;

import org.mo.com.xml.IXmlObject;

//============================================================
// <T>命令接口对象的XML节点基类。</T>
//============================================================
public interface XActionFace
      extends IXmlObject
{
   // 名称定义
   String NAME = "IAction";

   // 命令的名称定义
   String PTY_ACTION = "action";

   // 页面的名称定义
   String PTY_PAGE = "page";

   //============================================================
   // <T>获得命令的内容。</T>
   //
   // @return 命令
   //============================================================
   String getAction();

   //============================================================
   // <T>设置命令的内容。</T>
   //
   // @param value 命令
   //============================================================
   void setAction(String value);

   //============================================================
   // <T>获得页面的内容。</T>
   //
   // @return 页面
   //============================================================
   String getPage();

   //============================================================
   // <T>设置页面的内容。</T>
   //
   // @param value 页面
   //============================================================
   void setPage(String value);
}