namespace MO.Common.Collection
{
   //============================================================
   // <T>名称和内容的成对对象。</T>
   //============================================================
   public class FPair<N, V> : IPair<N, V>
   {
      // 总数
      internal int _count;

      // 当前位置
      internal int _position;

      // 名称
      internal N _name;

      // 内容
      internal V _value;

      //============================================================
      // <T>获得总数。</T>
      //
      // @return 总数
      //============================================================
      public int Count {
         get { return _count; }
      }

      //============================================================
      // <T>获得位置。</T>
      //
      // @return 位置
      //============================================================
      public int Position {
         get { return _position; }
      }

      //============================================================
      // <T>获得名称。</T>
      //
      // @return 名称
      //============================================================
      public N Name {
         get { return _name; }
      }

      //============================================================
      // <T>获得内容。</T>
      //
      // @return 内容
      //============================================================
      public V Value {
         get { return _value; }
      }

      //============================================================
      // <T>判断是否为第一个内容。</T>
      //
      // @return 是否标志
      //============================================================
      public bool IsFirst() {
         return (_count > 0) ? (0 == _position) : false;
      }

      //============================================================
      // <T>判断是否为最后一个内容。</T>
      //
      // @return 是否标志
      //============================================================
      public bool IsLast() {
         return (_count > 0) ? (_count - 1 == _position) : false;
      }

      //============================================================
      // <T>设置对象内容。</T>
      //
      // @param name 名称
      // @param value 内容
      // @param position 位置
      //============================================================
      internal void Set(N name, V value, int position) {
         _name = name;
         _value = value;
         _position = position;
      }
   }
}
