using MO.Common.IO;
using MO.Common.Lang;

namespace MO.Common.Collection
{
   //============================================================
   // <T>属性。</T>
   //============================================================
   public class FProperty : FObject
   {
      // 名称
      protected string _name;

      // 内容
      protected string _value;

      //============================================================
      // <T>构造属性。</T>
      //============================================================
      public FProperty() {
      }

      //============================================================
      // <T>获得或设置名称。</T>
      //============================================================
      public string Name {
         get { return _name; }
         set { _name = value; }
      }

      //============================================================
      // <T>获得或设置内容。</T>
      //============================================================
      public string Value {
         get { return _value; }
         set { _value = value; }
      }

      //============================================================
      // <T>序列化内容到输出流。</T>
      //
      // @param output 输出流
      //============================================================
      public void Serialize(IOutput output) {
         output.WriteString(_name);
         output.WriteUTFString(_value);
      }
   }
}
