package org.mo.com.data;

//============================================================
// <T>可以访问数据库的接口。</T>
//
// @author MAOCY
//============================================================
public interface ISqlConnect
{
   //============================================================
   // <T>获得默认数据库链接。</T>
   //
   // @return 数据库链接
   //============================================================ 
   ISqlConnection activeConnection();

   //============================================================
   // <T>获得指定名称的数据库链接。</T>
   //
   // @param name 名称
   // @return 数据库链接
   //============================================================ 
   ISqlConnection activeConnection(String name);
}
