package org.mo.data.database;

import org.mo.eng.data.IConnectionConsole;

//============================================================
// <T>数据链接控制台接口。</T>
//============================================================ 
public interface IDataDatabaseConsole
{
   //============================================================
   // <T>加载处理。</T>
   //============================================================
   void initialize();

   //============================================================
   // <T>获得主域链接控制台。</T>
   //
   // @return 链接控制台
   //============================================================
   IConnectionConsole domainConnectionConsole();

   //============================================================
   // <T>获得分析链接控制台。</T>
   //
   // @return 链接控制台
   //============================================================
   IConnectionConsole analysisConnectionConsole();

   //============================================================
   // <T>获得数据链接控制台。</T>
   //
   // @parma id 编号
   // @return 链接控制台
   //============================================================
   IConnectionConsole dataConnectionConsole(long id);
}
