package org.mo.web.core.session;

import org.mo.eng.session.common.ISession;
import org.mo.web.core.container.common.FWebContainerCollection;
import org.mo.web.protocol.common.FWebHistory;
import org.mo.web.protocol.common.IWebUser;

//============================================================
// <T>网络会话接口。</T>
//============================================================
public interface IWebSession
      extends
         ISession
{
   //============================================================
   // <T>获得链接编号。</T>
   //
   // @return 链接编号
   //============================================================
   String connectId();

   //============================================================
   // <T>设置链接编号。</T>
   //
   // @param connectId 链接编号
   //============================================================
   void setConnectId(String connectId);

   //============================================================
   // <T>获得主题编号。</T>
   //
   // @return 主题编号
   //============================================================
   String themeId();

   //============================================================
   // <T>设置主题编号。</T>
   //
   // @param themeId 主题编号
   //============================================================
   void setThemeId(String themeId);

   //============================================================
   // <T>判断是否登录。</T>
   //
   // @return 是否登录
   //============================================================
   boolean isLogin();

   //============================================================
   // <T>获得网络用户。</T>
   //
   // @return 网络用户
   //============================================================
   IWebUser user();

   //============================================================
   // <T>获得容器集合。</T>
   //
   // @return 容器集合
   //============================================================
   FWebContainerCollection containers();

   //============================================================
   // <T>获得网络历史。</T>
   //
   // @return 网络历史
   //============================================================
   FWebHistory history();
}
