
namespace MO.Core.Forms.Geom
{
  public class FIntPoint3
   {
      // 横坐标。
      protected int _x;

      // 纵坐标。
      protected int _y;

      // 坐标。
      protected int _z;

      //============================================================
      // <T>获取或得到坐标。</T>
      //
      // @param value 坐标。
      // @return 坐标。
      //============================================================
      public int X {
         get { return _x; }
         set { _x = value; }
      }

      //============================================================
      // <T>获取或得到坐标。</T>
      //
      // @param value 坐标。
      // @return 坐标。
      //============================================================
      public int Y {
         get { return _y; }
         set { _y = value; }
      }

      //============================================================
      // <T>获取或得到坐标。</T>
      //
      // @param value 坐标Z。
      // @return 坐标Z。
      //============================================================
      public int Z {
         get { return _z; }
         set { _z = value; }
      }

      //============================================================
      // <T>接受外部属性的各个值</T>
      //
      // @param value 外部属性。
      // @return 外部属性。
      //============================================================
      public void Assign(FIntPoint3 point) {
         _x = point.X;
         _y = point.Y;
         _z = point.Z;
      }

      //============================================================
      // <T>设置外部属性的各个值</T>
      //
      // @param value 设置外部属性。
      // @return 设置外部属性。
      //============================================================
      public void Set(int x, int y, int z) {
         _x = x;
         _y = y;
         _z = z;
      }

      //============================================================
      // <T>转换属性显示属性的各个值</T>
      //
      // @param value 属性。
      // @return 属性。
      //============================================================
      public override string ToString() {
         return _x + "," + _y + "," + _z;
      }
   }
}
