namespace MS.Common.Content
{
   //============================================================
   // <T>文档注释。</T>
   //
   // @history MAOCY 140414
   //============================================================
   public class FXmlComment : FXmlElement
   {
      //============================================================
      // <T>构造文档注释。</T>
      //============================================================
      public FXmlComment() {
         _type = EXmlElementType.Comment;
      }
   }
}
