using MO.Common.Geom;
using MO.Common.Lang;
using MO.Direct2d.Draw;

namespace MO.Design2d.Frame.Core
{
   //============================================================
   // <T>界面控件层。</T>
   //============================================================
   public class FUiControlLayer : FObject
   {
      // 名称
      protected string _name;

      // 可见性
      protected bool _optionVisible = true;

      // 图片
      protected FDxBitmap _bitmap;

      //============================================================
      // <T>构造界面控件层。</T>
      //============================================================
      public FUiControlLayer() {
      }

      //============================================================
      // <T>获得或设置名称。</T>
      //============================================================
      public string Name {
         get { return _name; }
         set { _name = value; }
      }

      //============================================================
      // <T>获得或设置可见性。</T>
      //============================================================
      public bool OptionVisible {
         get { return _optionVisible; }
         set { _optionVisible = value; }
      }

      //============================================================
      // <T>判断是否含有位图。</T>
      //
      // @return 是否含有位图
      //============================================================
      public bool HasBitmap() {
         return (_bitmap != null);
      }

      //============================================================
      // <T>获得或设置位图。</T>
      //============================================================
      public FDxBitmap Bitmap {
         get { return _bitmap; }
         set { _bitmap = value; }
      }


      //============================================================
      // <T>获得尺寸。</T>
      //============================================================
      public SIntSize2 Size {
         get { return _bitmap.Size; }
      }

      //============================================================
      // <T>释放资源。</T>
      //============================================================
      public void Dispose() {
         if(_bitmap != null) {
            _bitmap.Dispose();
            _bitmap = null;
         }
      }
   }
}
