using MO.Content2d.Frame.Common;

namespace MO.Design2d.Frame.Property
{
   // 变更事件
   public delegate void HUiPropertyChanged(object sender, object resource, string name);

   //============================================================
   // <T>属性编辑器</T>
   //============================================================
   public interface IUiPropertyEditor
   {
      // 属性改变事件
      event HUiPropertyChanged PropertyChanged;

      //============================================================
      // <T>配置处理。</T>
      //============================================================
      void Setup();

      //============================================================
      // <T>获得分组名称。</T>
      //
      // @return 分组名称
      //============================================================
      string GroupLabel();

      //============================================================
      // <T>加载资源。</T>
      //
      // @param resource 资源
      //============================================================
      void LoadResource(FRcObject resource);

      //============================================================
      // <T>保存资源。</T>
      //============================================================
      void SaveResource();
   }
}
