package org.mo.eng.config.common;

import org.mo.com.xml.IXmlObject;

//============================================================
// <T>命令接口对象的XML节点基类。</T>
//============================================================
public interface XActionFace
      extends IXmlObject
{
   // 名称定义
   String NAME = "IAction";

   // 地址链接的名称定义
   String PTY_URI = "uri";

   // 实现接口的名称定义
   String PTY_FACE = "face";

   //============================================================
   // <T>获得地址链接的内容。</T>
   //
   // @return 地址链接
   //============================================================
   String getUri();

   //============================================================
   // <T>设置地址链接的内容。</T>
   //
   // @param value 地址链接
   //============================================================
   void setUri(String value);

   //============================================================
   // <T>获得实现接口的内容。</T>
   //
   // @return 实现接口
   //============================================================
   String getFace();

   //============================================================
   // <T>设置实现接口的内容。</T>
   //
   // @param value 实现接口
   //============================================================
   void setFace(String value);
}