package org.mo.eng.config.common;

import org.mo.com.xml.IXmlObject;

//============================================================
// <T>属性接口对象的XML节点基类。</T>
//============================================================
public interface XPropertyFace
      extends IXmlObject
{
   // 名称定义
   String NAME = "IProperty";

   // 数据内容的名称定义
   String PTY_DATA_VALUE = "data_value";

   // 数据类型的名称定义
   String PTY_DATA_TYPE = "data_type";

   //============================================================
   // <T>获得数据内容的内容。</T>
   //
   // @return 数据内容
   //============================================================
   String getDataValue();

   //============================================================
   // <T>设置数据内容的内容。</T>
   //
   // @param value 数据内容
   //============================================================
   void setDataValue(String value);

   //============================================================
   // <T>获得数据类型的内容。</T>
   //
   // @return 数据类型
   //============================================================
   String getDataType();

   //============================================================
   // <T>设置数据类型的内容。</T>
   //
   // @param value 数据类型
   //============================================================
   void setDataType(String value);
}