namespace MO.Common.Lang
{
   //============================================================
   // <T>存储信息。</T>
   //============================================================
   public class FDumpInfo : FString
   {
      // 存储级别
      protected EDumpLevel _level = EDumpLevel.Normal;

      // 存储深度
      protected int _deep;

      // 存储对象
      protected object _instance;

      //============================================================
      // <T>构造存储信息。</T>
      //============================================================
      public FDumpInfo() {
      }

      //============================================================
      // <T>构造存储信息。</T>
      //
      // @param instance 实体对象
      //============================================================
      public FDumpInfo(object instance) {
         _instance = instance;
      }

      //============================================================
      // <T>获得和设置存储级别。</T>
      //
      // @return 存储级别
      //============================================================
      public EDumpLevel Level {
         get { return _level; }
         set { _level = value; }
      }

      //============================================================
      // <T>获得存储深度。</T>
      //
      // @return 存储深度
      //============================================================
      public int Deep {
         get { return _deep; }
      }

      //============================================================
      // <T>获得和设置存储对象。</T>
      //
      // @return 存储对象
      //============================================================
      public object Instance {
         get { return _instance; }
         set { _instance = value; }
      }

      //============================================================
      // <T>增加一层深度。</T>
      //
      // @param instance 实体对象
      //============================================================
      public void IncreaseDeep(object instance) {
         _instance = instance;
         _deep++;
      }

      //============================================================
      // <T>减少一层深度。</T>
      //
      // @param instance 实体对象
      //============================================================
      public void DecreaseDeep() {
         _deep--;
      }

      //============================================================
      // <T>开始调试。</T>
      //============================================================
      public void Begin() {
         RDump.StartDump(this);
      }

      //============================================================
      // <T>结束调试。</T>
      //============================================================
      public void End() {
         RDump.StopDump(this);
      }

      //============================================================
      // <T>追加制表符。</T>
      //
      // @param dump 转储信息
      // @param deep 制表深度
      //============================================================
      public void AppendSpace(int deep) {
         RDump.AppendSpace(this, deep);
      }
      
      //============================================================
      // <T>追加存储信息。</T>
      //
      // @param value 对象
      //============================================================
      public void AppendDump(object value) {
         if(null == value) {
            Append("@null");
         } else {
            Append(value.ToString());
         }
      }
   }
}
