namespace MO.Common.Lang
{
   //============================================================
   // <T>逻辑例外。</T>
   //============================================================
   public class FLogicException : FException
   {
      //============================================================
      // <T>构造逻辑例外。</T>
      //============================================================
      public FLogicException() {
      }

      //============================================================
      // <T>构造逻辑例外。</T>
      //
      // @param message 消息对象
      // @param args 参数集合
      //============================================================
      public FLogicException(object message, params object[] args)
         : base(message, args) {
      }
   }
}
