namespace MO.Common.Lang
{
   //============================================================
   // <T>比较接口。</T>
   //============================================================
   public interface IObjectComparer<S, T>
   {
      //============================================================
      // <T>比较两个对象。</T>
      // <P>源对象 < 目标对象，返回正数。</P>
      // <P>源对象 = 目标对象，返回0。</P>
      // <P>源对象 > 目标对象，返回负数。</P>
      //
      // @param source 源对象
      // @param target 目标对象
      // @param args 参数列表
      //============================================================
      int Compare(S source, T target, params object[] args);
   }
}
