using MO.Common.Content;

namespace MO.Common.Lang
{
   //============================================================
   // <T>资源对象接口。</T>
   //============================================================
   public interface IResource
   {
      //============================================================
      // <T>查找指定名称的布尔值。</T>
      //
      // @param name 名称
      // @return 布尔值
      //============================================================
      bool FindBool(string name);

      //============================================================
      // <T>查找指定名称的整数。</T>
      //
      // @param name 名称
      // @return 整数
      //============================================================
      int FindInt(string name);

      //============================================================
      // <T>查找指定名称的长整数。</T>
      //
      // @param name 名称
      // @return 长整数
      //============================================================
      long FindLong(string name);

      //============================================================
      // <T>查找指定名称的字符串。</T>
      //
      // @param name 名称
      // @return 字符串
      //============================================================
      string FindString(string name);

      //============================================================
      // <T>查找指定名称的显示字符串。</T>
      //
      // @param name 名称
      // @return 字符串
      //============================================================
      string FindDisplay(string name);

      //============================================================
      // <T>查找指定名称的显示字符串。</T>
      //
      // @param name 名称
      // @param args 参数列表
      // @return 字符串
      //============================================================
      string FindDisplay(string name, params object[] args);
   }
}
