using System;

namespace MO.Common.Lang
{
   //============================================================
   // <T>唯一标识生成类。</T>
   //
   // @history 110602 MAOCY 创建
   //============================================================
   public class RGuid
   {
      //============================================================
      // <T>生成唯一标识。</T>
      //
      // @return 唯一标识字符串
      //============================================================
      public static string GenerateAsString() {
         return Guid.NewGuid().ToString();
      }
   }
}
