package org.mo.eng.mail;

import org.mo.core.aop.face.AProperty;

//============================================================
// <T>邮件分组。</T>
//============================================================ 
public class FMailGroup
{
   // 名称
   @AProperty
   protected String _name;

   // 发送目标
   @AProperty
   protected String _to;

   // 抄送目标
   @AProperty
   protected String _cc;

   // 暗送目标
   @AProperty
   protected String _bcc;

   //============================================================
   // <T>构造邮件分组。</T>
   //============================================================ 
   public FMailGroup(){
   }

   //============================================================
   // <T>获得名称。</T>
   //
   // @return 名称
   //============================================================ 
   public String name(){
      return _name;
   }

   //============================================================
   // <T>获得发送目标。</T>
   //
   // @return 发送目标
   //============================================================ 
   public String to(){
      return _to;
   }

   //============================================================
   // <T>获得抄送目标。</T>
   //
   // @return 抄送目标
   //============================================================ 
   public String cc(){
      return _cc;
   }

   //============================================================
   // <T>获得暗送目标。</T>
   //
   // @return 暗送目标
   //============================================================ 
   public String bcc(){
      return _bcc;
   }
}
