package org.mo.eng.mail;

import org.mo.com.net.mail.FMail;

//============================================================
// <T>邮件控制台接口。</T>
//============================================================ 
public interface IMailConsole
{
   //============================================================
   // <T>根据名称获得邮件组。</T>
   //
   // @param name 名称
   // @return 邮件组
   //============================================================
   FMailGroup findGroup(String name);

   //============================================================
   // <T>发送邮件。</T>
   //
   // @param mail 邮件
   // @return 处理结果
   //============================================================
   boolean send(FMail mail);

   //============================================================
   // <T>发送邮件组。</T>
   //
   // @param groupName 邮件组
   // @param mail 邮件
   // @return 处理结果
   //============================================================
   boolean sendGroup(String groupName,
                     FMail mail);
}
