package org.mo.com.net.mail;

import javax.activation.DataSource;
import org.mo.com.lang.RString;

//============================================================
// <T>邮件附件。</T>
//============================================================ 
public class TMailPart
{
   // 名称
   protected String _name;

   // 类型
   protected String _mimeType;

   // 编号
   protected String _contentId;

   // 数据来源
   protected DataSource _source;

   //============================================================
   // <T>构造邮件附件。</T>
   //============================================================ 
   public TMailPart(){
   }

   //============================================================
   // <T>构造邮件附件。</T>
   //
   // @param source 来源
   //============================================================ 
   public TMailPart(DataSource source){
      _source = source;
   }

   //============================================================
   // <T>获得名称。</T>
   //
   // @return 名称
   //============================================================ 
   public String name(){
      return _name;
   }

   //============================================================
   // <T>设置名称。</T>
   //
   // @param name 名称
   //============================================================ 
   public void setName(String name){
      _name = name;
   }

   //============================================================
   // <T>获得类型。</T>
   //
   // @return 类型
   //============================================================ 
   public String mimeType(){
      return _mimeType;
   }

   //============================================================
   // <T>设置类型。</T>
   //
   // @param mimeType 类型
   //============================================================ 
   public void setMimeType(String mimeType){
      _mimeType = mimeType;
   }

   //============================================================
   // <T>判断内容编号是否存在。</T>
   //
   // @return 是否存在
   //============================================================ 
   public boolean hasContentId(){
      return !RString.isEmpty(_contentId);
   }

   //============================================================
   // <T>获得内容编号。</T>
   //
   // @return 内容编号
   //============================================================ 
   public String contentId(){
      return _contentId;
   }

   //============================================================
   // <T>设置内容编号。</T>
   //
   // @param contentId 内容编号
   //============================================================ 
   public void setContentId(String contentId){
      _contentId = contentId;
   }

   //============================================================
   // <T>获得数据来源。</T>
   //
   // @return 数据来源
   //============================================================ 
   public DataSource source(){
      return _source;
   }

   //============================================================
   // <T>设置数据来源。</T>
   //
   // @param source 数据来源
   //============================================================ 
   public void setSource(DataSource source){
      _source = source;
   }
}
