#include "MoCmSystem.h"

MO_NAMESPACE_BEGIN

//============================================================
// <T>构造监听器。</T>
//============================================================
FListener::FListener(){
   _typeCd = EListenerType_Any;
   _manageCd = EListenerManage_Free;
}

//============================================================
// <T>析构监听器。</T>
//============================================================
FListener::~FListener(){
}

//============================================================
// <T>获得类型。</T>
//
// @return 类型
//============================================================
EListenerType FListener::TypeCd(){
   return _typeCd;
}

//============================================================
// <T>获得管理类型。</T>
//
// @return 管理类型
//============================================================
EListenerManage FListener::ManageCd(){
   return _manageCd;
}

//============================================================
// <T>调用处理。</T>
//
// @param pParameters 参数集合
// @return 处理结果
//============================================================
TBool FListener::Process(TAny* pParameters){
   return ETrue;
}

MO_NAMESPACE_END
