#include "MoCmInterface.h"

MO_NAMESPACE_BEGIN

//============================================================
// <T>构造托管对象基类。</T>
//============================================================
FManagedObject::FManagedObject(){
   _referenceCount = 1;
}

//============================================================
// <T>析构托管对象基类。</T>
//============================================================
FManagedObject::~FManagedObject(){
}

//============================================================
// <T>释放处理。</T>
//============================================================
TResult FManagedObject::Dispose(){
   _referenceCount = 0;
   return ESuccess;
}

MO_NAMESPACE_END
