#include "MoCmData.h"
#include "MoCmMemory.h"
#include "MoCmPool.h"

MO_NAMESPACE_BEGIN

//============================================================
// <T>¹¹ÔìÃüÁî×Ö·û´®»º³å¡£</T>
//============================================================
FSqlPool::FSqlPool(){
}

//============================================================
// <T>Îö¹¹ÃüÁî×Ö·û´®»º³å¡£</T>
//============================================================
FSqlPool::~FSqlPool(){
}

//============================================================
// <T>ÊÕ¼¯Ò»¸öÃüÁî×Ö·û´®¡£</T>
//
// @return ÃüÁî×Ö·û´®
//============================================================
FSql* FSqlPool::Alloc(){
   FSql* pSql = NULL;
   _locker.Enter();
   if(!HasFreeItem()){
      Store(MO_CREATE(FSql));
   }
   pSql = AllocFirst();
   _locker.Leave();
   return pSql;
}

//============================================================
// <T>ÊÍ·ÅÒ»¸öÃüÁî×Ö·û´®¡£</T>
//
// @param pSql ÃüÁî×Ö·û´®
//============================================================
void FSqlPool::Free(FSql* pSql){
   _locker.Enter();
   FreeLast(pSql);
   _locker.Leave();
}

MO_NAMESPACE_END
