#include "MoCmStream.h"

MO_NAMESPACE_BEGIN

//============================================================
// <T>构造输出数据流的实例。</T>
//
// @return 实例指针
//============================================================
TDataWriter::TDataWriter(){
   _pWriter = NULL;
}

//============================================================
// <T>构造输出数据流的实例。</T>
//
// @param pWriter 输出接口
//============================================================
TDataWriter::TDataWriter(IWriter* pWriter){
   _pWriter = pWriter;
}

//============================================================
// <T>析构输出数据流的实例。</T>
//============================================================
TDataWriter::~TDataWriter(){
}

//============================================================
// <T>获得输出接口。</T>
//
// @return 输出接口
//============================================================
IWriter* TDataWriter::Writer(){
   return _pWriter;
}

//============================================================
// <T>设置输出接口。</T>
//
// @param pWriter 输出接口
//============================================================
void TDataWriter::SetWriter(IWriter* pWriter){
   _pWriter = pWriter;
}

//============================================================
// <T>写入数据</T>
//
// @return 返回写入长度
//============================================================
TInt TDataWriter::Write(TCharC* pData, TSize size){
   return _pWriter->Write(pData, size);
}

MO_NAMESPACE_END
