using MO.Common.Collection;

namespace MO.Common.Content
{
   //============================================================
   // <T>节点工厂接口。</T>
   //============================================================
   public interface IXmlNodeFactory
   {
      //============================================================
      // <T>创建文档节点。</T>
      //
      // @param name 节点名称
      // @param attributes 属性列表
      // @return 文档节点
      //============================================================
      FXmlNode CreateNode(string name, FAttributes attributes);

      //============================================================
      // <T>创建文档注释。</T>
      //
      // @return 注释节点
      //============================================================
      FXmlComment CreateComment();
   }
}
