using MO.Bridge.Core.Event;

namespace MO.Bridge.Engine.Display
{
   //============================================================
   // <T>显示对象。</T>
   //
   // @history MAOCY 140513
   //============================================================
   public class FDisplay : FEventDispatcher
   {
      // 名称
      protected string _name;
      
      //============================================================
      // <T>显示对象。</T>
      //
      // @history MAOCY 140513
      //============================================================
      public FDisplay() { 
      }

      //============================================================
      // <T>获得或设置名称。</T>
      //============================================================
      public string Name {
         get { return _name; }
         set { _name = value; }
      }
   }
}
